[
{"author": ["Chuck & Karen"], "title": ["Smart TV for a smart price"], "rating": ["5.0 out of 5 stars"], "date": ["on April 30, 2017"], "helpful_to": ["1,440 people found this helpful"], "content": ["OK, so right off the bat I will say \"WOW\".  For about $170, I was not expecting a lot of bells and whistles, which is fine for a newly converted \"exercise room\".  Upon delivery I was amazed at how light this TV was.  While mounting on an articulating arm mount, I actually held it in place with one hand while I screwed it into the mounts.  I was fearing it to be a \"toy\" quality because of it's light weight, but once I turned it on, I was pleasantly surprised.  The colors are great, it is rich in features and has some very intuitive interface design qualities.", "-- It's a smart TV, and happily the features work great.  It connected to my WiFi with no problems and the connection is strong (meaning the internal adapter is well made).  Previously I've had issues with Vizio TV's connecting, so this was a great relief.  The integrated Roku works flawlessly and the set up was easy and intuitive.  It quickly walked me though my Roku, Hulu, Amazon and other accounts.", "Since this TV is in a room not served by cable or satellite, I connected it to a very handy Winegard FL-55YR FlatWave Indoor Antenna  and VIOLA! I had 40 channels of OTA TV to augment my Roku.", "The remote is small and is just like a normal Roku remote with the addition of channel and volume controls plus a handy mute button.  And as a fantastic BONUS - by adding a thumb drive to the TV's rear USB port, you can pause live TV for up to 90 minutes.  That was totally unexpected and a really nice surprise. (NOTE- they suggest a 16GB drive or less.  Anything more won't extend the 90 minutes and would be wasted space).", "Bottom line:  Great little TV, lots of features; great interface, Smart TV that works -- and it has an earphone jack if you need it."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Morgan"], "title": ["Already acting up not even a week in. 2 months later lines across screen"], "rating": ["1.0 out of 5 stars"], "date": ["on September 25, 2017"], "helpful_to": ["289 people found this helpful"], "content": ["I have had it for 6 days, and now every few minutes I get kicked out of Netflix and put back onto the main tv screen. It's very annoying....", "UPDATE... 2 months in, and I turn It On to find lines across the screen"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["SfMarkH"], "title": ["TV Great!  Beware of Roku Support Scam"], "rating": ["5.0 out of 5 stars"], "date": ["on July 16, 2018"], "helpful_to": ["57 people found this helpful"], "content": ["Okay, I installed this TV 3 hours ago and so far good!  The picture, clarity, color are all better than my 28\" Sharp which this is replacing.  The Sharp worked fine for 6 years, about as long one should expect it to. SCAM ALERT  I did run into a situation and I want to warn others about it.  When I was setting up Roku, I could not get it to activate and it gave me the number of Roku support to call.  I phoned and was told by a Jerry Maxwell I would need to purchase a license.  There was a standard for 3 years 3 device for $79.00 or a deluxe licence  for 5 years unlimited devices (don't have cost).  I was angry that I had to pay 79.00 for Roku since I had a Roku stick already but I thought what the hell I want Roku.  I told the guy this is bull****!.  He said he would call back.  In the meantime I tried activating through my roku account and it went through!  So maybe Jerry did something but when he called back, I said it's working and I 'm not paying $79.00!  He hung up.  So SCAM ALERT"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["BossWolf"], "title": ["Impressive quality viewing. No antenna, cable or satellite feed!"], "rating": ["5.0 out of 5 stars"], "date": ["on October 13, 2017"], "helpful_to": ["51 people found this helpful"], "content": ["I am thrilled with the TV. It is terrific for my purpose. Surprisingly great picture quality. I am not using a cable, satellite or antenna feed of any kind. I have my WiFi connection for the Roku channels, a Google Mi TV Box, a Chromecast unit and an Android TV Media Box with KODI app installed. It is fabulous! Just can't praise it enough. I do have one minor gripe .. the light on the front-bottom of the set that blinks to tell you when some command is being received from the remote. The only time this light turns OFF is when there is a picture on the screen or when  the set is unplugged. My usage is in the bedroom .. that is supposed to be dark at night. I do not want to get up and unplug the TV at the end of an evening's viewing. There needs to be a way to use the remote to turn this light OFF. (update: TCL has responded to this review and has solved this problem. The light goes off when the TV does. Success! Thank You TCL.)", "The only other problem I had was not TCL, Roku or Amazon's fault. It was the transit company who did not deliver in two days by 8 PM as they committed to. They were a day late but that will happen if you let the package sit on the floor at the airport freight terminal for 27 hours without it moving. Doesn't make much sense to pay the high price to expedite it out of Atlanta and then have it sit for two days at the receiving airport. It was a day late. The family was so excited with the anticipated arrival of the new TV .. only to have the celebration quashed by the freight delivery company. Unfortunate."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Jay"], "title": ["Value for money."], "rating": ["5.0 out of 5 stars"], "date": ["on March 25, 2017"], "helpful_to": ["272 people found this helpful"], "content": ["This is the first TV we bought and we wanted a smart TV. The past reviews of TCL were way too good. Hence, we went with the latest 2017 version.", "The delivery was quick and the TV is very light. Good resolution and top of that its Roku compatible. That means you dont have to buy Roku dongle.", "In a gist, it's value for money. Must buy if you are looking for a cheap Smart TV with a brand name involved."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Maine Boy"], "title": ["Completely failed in one hour"], "rating": ["1.0 out of 5 stars"], "date": ["on August 12, 2017"], "helpful_to": ["218 people found this helpful"], "content": ["After I carefully hooked up this TV, it worked perfectly for about an hour and did everything I wanted - cable TV, Roku, and Hulu.  After about an hour the screen suddenly went completely blooey (that is the technical term for a lot of vertical lines over the screen and an unwatchable picture.)  I went over all the connections and double and triple-checked them.  They were all fine and as should be.  I finally hooked up my previous TV and everything is fine and I have to return this TV.  Thank heavens for Amazon Prime.  I don't know what you call the thing that replaces the picture tube in these new TVs but I guess this one failed completely after about an hour.  I won't waste time on another one of these so this one is going back for a refund."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["South Texan"], "title": ["Great TV, better than the price would indicate"], "rating": ["5.0 out of 5 stars"], "date": ["on May 15, 2017"], "helpful_to": ["258 people found this helpful"], "content": ["Bought for my Girlfriend, picture is great and love the base.  much more stable that the usual single stick in the middle, just be sure your table is wide enough to fit it.  Like that the cable box fits perfectly underneath it.  Two cons though: it has no external switches for off/on/menu so if you loose the remote control, you are so boned.  You can't turn even turn it off or on.  Second, my GF does not like the small remote control.  I don't see it as an issue, but she does. Those are my only issues though.  Other than that, picture is great, sound is great, Roku features work great as well and price was super attractive.", "Note: Added photo of the switches for comments below.  Were a bit hard to find."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Lenkey"], "title": ["One Large Problem - otherwise good."], "rating": ["2.0 out of 5 stars"], "date": ["on September 29, 2017"], "helpful_to": ["27 people found this helpful"], "content": ["This TV has a problem.  The roku function is poor with Netflix.  When streaming netflix it freezes and reboots about every 20 minutes.  This is an unacceptable problem.", "Otherwise TV has a good picture, good sound."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["\"You buy cheap, you buy twice\""], "rating": ["1.0 out of 5 stars"], "date": ["on August 23, 2017"], "helpful_to": ["394 people found this helpful"], "content": [" The manufacturer sent a defective product that had outdated software and therefore was not able to connect to the internet and be set up. The manufacturer refused to take ownership or even offer any discount for the inconvenience. Huge lack of support by TCL.", "The MAC address was 00:00:00:00:00:00", "The Software version was: version 7.2.5 - build 6316-08", "Also, the guys troubleshooting process was literally:", "1. Turn Off/Turn On", "2. Reset", "Terrible experience. I requested a full refund from Amazon and will never buy TCL"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Peter Brents"], "title": ["May be a good tv, not for me."], "rating": ["1.0 out of 5 stars"], "date": ["on June 11, 2018"], "helpful_to": ["12 people found this helpful"], "content": ["I loved this television when I first got it, but it failed after about a month. Okay, these things happen. I returned the tv for repair, and a few days later I got an email saying my tv had been repaired and was on its way back. When I got it back it still did not work. I phoned the company and was promised a replacement. I later got a call from TCL to say that they had lied to me for a second time. They had not repaired my tv and they were not going to replace it. They claimed that there was a \"biological hazard\" in the tv. I spoke to several members of their staff, and the upshot is that they feel empowered to tell lies whenever it suits them, that their promises mean absolutely nothing.", "I opened up the worthless tv and found no evidence of a \"biological hazard. I believe I could repair it with one of the small boards at the back. Interestingly, that particular board appears to be unavailable.", "My conclusion is that this might be a good buy if you also buy insurance for it. DO NOT rely on just TLC."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Kevin G."], "title": ["The worst issues are those you can't see."], "rating": ["3.0 out of 5 stars"], "date": ["on November 30, 2017"], "helpful_to": ["11 people found this helpful"], "content": ["I have owned this TV for just under three months. Had I posted a review within my first two months of ownership, I would probably have given this set five stars. At its price point, this television has an incredibly user-friendly UI and a crisp enough image for 720p, though I found the image settings to be incredibly lacking. There are plenty of great applications, and I keep Netflix, Hulu, and Prime video at the top of my homepage. However, it seems that you get what you pay for in processing power, and these issues have become more apparent as time goes on. My unit is situated about two feet from my router with high speed internet. In the beginning, streaming through the Netflix or Hulu app was lightning quick. However, a few weeks ago, my unit began experiencing severe slowdowns. The menu was lagging, apps were taking minutes to open, and the TV wouldn't even shut off after the power button was pressed. These issues weren't associated with my internet connection, but with the operation of the Roku OS. After these slowdowns began, video streaming was absolutely crippled. I am unable to watch any media through Netflix, Hulu, Prime video, or Acorn, as they will just buffer indefinitely. Streaming is still perfect on a laptop or phone in the same vicinity, but the television just can't handle it. After resetting the television, wifi, and any other possible factors, I've come to accept that the \"smart\" aspect of this set is irrevocably damaged. While the selling price may be great for a smart TV, mine can now only operate as a screen to display offline media, and I'm sure that there are many TV's out there that can do the same task at a lower price and higher build quality."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Ece Pe"], "title": ["Great purchase!"], "rating": ["5.0 out of 5 stars"], "date": ["on May 25, 2017"], "helpful_to": ["40 people found this helpful"], "content": ["I purchased 49'' for my new apartment and it looks great. Set up was really easy."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["JaJA"], "title": ["A good secondary or apartment TV. This is not a centerpiece, main TV."], "rating": ["4.0 out of 5 stars"], "date": ["on January 12, 2018"], "helpful_to": ["2 people found this helpful"], "content": ["This is a pretty good deal for a 40\" TV. Here is my review.", "Price: It has a good price for it's size and being an LED Smart TV. It is competitive.", "Picture: In standard low definition the picture is not too good. It is passable, but if you are used to like me years of watching 1080p and then look at this TV's standard non 1080p you will know what I am talking about. The picture is not good. But, if you view this TV in 1080p then the picture is very good. It is not as good as my 46\" 1080p more expensive TV, but it is a fraction of the cost. Also I got this for a female friend who does not play any video games so I cannot say if this TV is good for that use. She likes the picture on it and in the end I guess that is the most important thing.", "Sound: It's normal TV sound. For the apartment that it is in it is fine. This is not a TV I would have as my main TV to watch something that needs great audio, but as an apartment TV or bedroom TV it is fine.", "Apps: It comes preloaded with apps, and you can add all of the popular ones.", "Internet: I wired this with an ethernet cable to make sure it always had the best bandwidth available. Occasionally the picture will degrade from low bandwidth and I do mean occasionally. This does not happen that often.", "Overall I am happy, and the recipient of this gift is happy with this TV."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["UNyque B"], "title": ["It came at a good time and well packaged"], "rating": ["5.0 out of 5 stars"], "date": ["on January 7, 2018"], "helpful_to": ["2 people found this helpful"], "content": ["This was brought for my mom for the holiday.  It came at a good time and well packaged. I opened it and found that I had to do extra things just to watch the TV.", "You have to connect and set up a lot of things to us this TV to the Roku system.  You have to decide if you want to add the extra channels. You have to connect the internet and other things.  The TV stays on the home screen which was confusing for her. For the first couple of days, she could not just turn on the TV and go to a channel.  She had to use the actual TV remote to turn to the cable section on the menu before she could reach the live TV.  This was frustrating to her which made me upset.  I had to google to find out how to set the TV so that she could actually watch TV verse being on all the applications on the screen.  I finally figured it out with the help of Google search a now she can turn to just the TV.", "On the flip side, this TV has a beautiful color.  The sound is great.  The size is perfect.  Changing channels works get. It works well with my cable box.  It is light so lifting it was an ease.  It fit great on my stand and the legs came so that you could attach them either straight or at an angle.", "This is good for a younger more computer savvy person but please be mindful when buying for the much older generation unless they are computer Tech savvy.  Since I am much younger, I was able to watch Netflix with no issues.  I may have to switch with her and place this TV in my room since it works better for me (the computer geek).", "I hope this helps."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["John S."], "title": ["TCL common sense remote."], "rating": ["5.0 out of 5 stars"], "date": ["on July 3, 2017"], "helpful_to": ["4 people found this helpful"], "content": ["We bought this 28\" (smart) TV for use in kitchen as OTA TV only without internet or any other connections. This is our third TCL TV and another outstanding value with easy  setup and use. Finally someone with common sense designed a remote control without the never used/needed numeric key pad. This remote is as simple to use to select channels as it was before the age of digital electronic. The second thing we noticed is the sound quality of the speakers. I'm sorry I can't comment on the \"smart/Roku\" functions but I'm sure TCL got those right too."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["Donna Gall"], "title": ["Made a great wedding anniversary present for my parents.  They love their new Smart TV!"], "rating": ["5.0 out of 5 stars"], "date": ["on September 15, 2017"], "helpful_to": ["116 people found this helpful"], "content": ["My parents wanted a new 32inch TV and since it was their wedding anniversary, we purchased this item for them.  They are more than happy with it and it has exceeded their expectations of a TV.  This is actually their first Smart TV and they are enjoying all of the great features it offers. They love to watch movies so, we purchased them a Netflix subscription and now they get to watch their movies in Style.  It has been easy for them to switch back and forth between cable and then to the Smart TV.  My mom loves watching YouTube videos and now she gets to enjoy it on this TV instead of her computer.  Best Anniversary gift ever!", "When the TV arrived, the box itself was light and when my husband took the TV out to install it, it was very light for him to carry. Setting up the TV was simple and straightforward.  My husband did it for them and it did not take very long.  He also programmed the cable remote to this TV so they only need one remote to turn the TV on and off.  The HD picture is very crisp and the colors are vibrant not to mention the quality of the sound.  Wifi is very easy to connect just as easy with any other device they have.", "The remote has been very easy for them to use, it is not big and bulky but, small and light and fits perfectly in their hand. They are both learning how to use their phone to work the TV, very impressive feature.  This TV comes packed with many Apps and they are so happy with their TV that they are learning how to use all of them.", "Impressive TV with many features at a great price to boot. We own several Smart TV's but, none of them have features like this one offers.  Very happy that we purchased this TV for my parents and would recommend this Smart TV for sure."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["T. Graves"], "title": ["Exceeded my expectations"], "rating": ["5.0 out of 5 stars"], "date": ["on December 11, 2017"], "helpful_to": ["2 people found this helpful"], "content": ["This is a fantastic TV. The 1080p resolution at 40\" is a great picture. The Roku software is intuitive to use and a great selection of online movies and TV shows. The remote is well designed and while I miss the 0-9 buttons to directly select a station it is not a big deal if you are using either an antenna (smaller selection of channels) or just wifi. I can still scroll pretty quickly through channels and the back button allows you to switch between two channels quickly if you are watching two live sports at the same time (for example). The built in speakers sound good for this size television and there are several ways of connecting media into it (HDMI, USB, antenna,etc). It even supports pausing live antenna/cable shows if you add your own 16 GB flash drive to a USB port.", "I don't know what the reliability is like, but I will edit this post if it dies. Right now though I am very happy with it."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Bonbon"], "title": ["Hello TCL!"], "rating": ["5.0 out of 5 stars"], "date": ["on October 6, 2017"], "helpful_to": ["12 people found this helpful"], "content": ["This is my first Smart TV. Let me tell you, I am impressed. It connects to internet even with the weakest signal. You can install an app on your smartphone and use smartphone as your remote. Picture quality is great on all free and paid online services. I tried YouTube without creating an account and quality is not acceptable. I guess creating an account would let me pick quality. Or maybe watching through the web browser installed on TV? It is my first month with this Smart TV and I feel I should have bought it earlier. Never had TCL products before. Always been a huge Sony fan, but guess what, this TV is as good as Sony TV I was checking at the store. Overall, I am enjoying every minute of watching this TV. We will see how long it will last."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Bill"], "title": ["Can't beat the quality for the price!"], "rating": ["5.0 out of 5 stars"], "date": ["on December 13, 2017"], "helpful_to": ["2 people found this helpful"], "content": ["For the price, this TV is amazing! I picked it up on a Cyber Monday flash sale for $180, but even at its regular price ~$250 you'd probably still be hard pressed to find better value for your money. It's only 1080p, but unless you're stilling pretty close to it, your eyes can't tell the difference between 1080p and 4k (if you're in to all the nerdy comparisons, definitely check out RTings.com). The biggest drawback of this TV I had read about was that it is very dim compared to most modern HDTVs. But I was pleasantly surprised that I could see it just fine in my living room, which has windows, a sliding door, and skylights. Unless you're watching this thing in direct sunlight, I don't think anyone would have an issue seeing the screen. The viewing angle seems fine, too. Almost every LED screen is knocked for poor viewing angle, but I can tell you that walking around in my medium sized living room I don't notice much degradation of the picture.", "The features of the TV itself are fine. 3 HDMI inputs including one that can be used as an Audio Return Channel (ARC), optical out that passes through Dolby surround (supposedly DTS too, though RTings says it didn't work even when they set it up that way), and probably some other stuff too that I'm not using. The Roku interface is nice. I have an AppleTV that I used with my last TV, but if you don't have a streaming box you really don't need one with this TV. It has all the native streaming apps you would expect (including one for Tablo!), and the menu seems pretty responsive, though admittedly I've only streamed through my AppleTV so I can't speak to the watching experience through Roku. It was also easy to set up, and despite what I saw some other people say, there is no cost to get everything started up and updated (though some of the Roku streaming channels do have cost associated).", "The only thing that would make me change my rating would be the longevity of the set. So far so good. As long as it doesn't meet an untimely demise I'll be a happy camper!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["Wouldn't recommend this at all"], "rating": ["1.0 out of 5 stars"], "date": ["on June 22, 2017"], "helpful_to": ["83 people found this helpful"], "content": ["Junk. Worked for 2 months and quit. Wouldn't recommend this at all. Waste of money can buy cheaper name brand tvs at Walmart and have no problems"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Nick Qualkenbush"], "title": ["Don't waste your money"], "rating": ["2.0 out of 5 stars"], "date": ["on August 16, 2017"], "helpful_to": ["6 people found this helpful"], "content": ["It's alright for the price I guess, but get something better if you can afford it. Remote it comes with barely works. I think about half my button presses get registered. Also was randomly changing input sources when. I was trying to sign into netflix, what's up with that? Also there's no buttons on the TV itself so if you lose the remote you're sol.", "EDIT: Removing another star because now Netflix doesn't even work on this thing. Randomly kicking me to the home screen about 5 seconds after starting anything"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Happy Home Inc."], "title": ["Completely Broken Product"], "rating": ["1.0 out of 5 stars"], "date": ["on August 25, 2017"], "helpful_to": ["23 people found this helpful"], "content": ["I was really excited to find an affordable TV that could replace my old one. Unfortunately, this TV will not do the trick. The packaging that this TV was shipped in was clearly opened before and a had dents and scratches in it everywhere. Before setting up the tv I plugged it in to see if it worked. Of course, the TV screen was completely distorted and wouldn't even show a picture. It was really disappointing to see."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["John Conley"], "title": ["Better than expected, very nice picture, multiple inputs, unmatched price, Roku equipped. Durability ?"], "rating": ["5.0 out of 5 stars"], "date": ["on August 25, 2018"], "helpful_to": ["One person found this helpful"], "content": ["Set up, picture, sound, connections, and Roku are so far all better than expected, especially at this price on the 28 inch model I purchased. The TV arrived 2 days after ordering and was well and securely packaged. At first I was not so happy about having to screw in the two stands but it was actually pretty easy and it seems secure. Once turned on it asked for the internet password and it connected in a flash. The Roku likewise was a breeze, especially if you already have a Roku account. Be sure to be near a computer, tablet or smart phone in order to go to the Roku site to input the code the TV provides for completing the Roku set up.", " I like that there are multiple connecting ports, all of which are easily reached. Having 3 HDMI, including one with ARC was really a plus. I also connected an over the air antenna (we are cord cutters) and that, too, proved quite easy. Picture quality is not up to par with our much more expensive plasma set, but definitely quite good (4 out of 5 stars). The picture is bright out of the box with good contrast and fairly good viewing angles but controls for adjusting the picture are provided and very easy to use.", "The remote, like the TV, is very easy to use but the absence of a number pad is regrettable. If you have used a Roku or Firestick remote you will note similarities in the layout, with additional buttons for Netflix, Amazon, Sling and HULU. Batteries are also provided.", "Some people complained about the sound volume being inadequate but I had no problem hearing the TV in our bedroom, even with a loud fan running running near the TV. But if you prefer to add external speakers the needed input is there. It even provides an optical digital audio port.", "At this point the only issue I am somewhat apprehensive about is durability since this is the first TLC TV for me. With electronics I prefer brands such as Panasonic, LG, Sony, Samsung, etc. but this TV has mostly good reviews and with the incredible price I decided to take the plunge. If the TV seems to fail prematurely I will post a follow-up.", "In summary, the price is inbeatable, the picture better than expected, sound volume absolutely fine for a smaller room such as a bedroom (remember, I am rating a small 28 inch model), set up is a breeze, and the fact that it is Roku equipped and a Smart TV is great. It so far is exceeding expectations. It has a full array of inputs. The remote is adequate but lacks a number pad.", "The only concern will relate to durability over time."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["jenna"], "title": ["Returned TV"], "rating": ["1.0 out of 5 stars"], "date": ["on December 31, 2017"], "helpful_to": ["34 people found this helpful"], "content": ["I've had to update this review a couple times, ultimately ended up returning TV. Here's the saga:", "Got the TV about 4 days ago. Had issues connecting to WiFi while setting it up, contacted TCL customer support. While on the phone, the TV connected. All is well.", "The next day, it lost the WiFi connection again and could not get back on. Called customer support. They had me turn off the network pings and said said this would resolve the connectivity issue permanently.", "Two days later, TV lost the WiFi and could not get back on. Network pinging is still off. Call customer support. Tech tells me to do literally the opposite of what the guy told me last time, TV still doesn't work. He is out of ideas of what to tell me (asked me if my password was correct a thousand times). Finally said it must be something else, call your internet provider.", "Called the internet provider. Nothing on their end. Could be the router but the router is mine. Went to return the TV and tried Amazon tech support as a last ditch effort. He was SUPER helpful and helped me change my router settings to match what the TV wanted. This seemed like it was the issue, and the last thing left to try. That worked....for about two hours. Then it lost the WiFi again and there was no explanation. Instead of calling tech support for the 5th time in 4 days, I decided to return the TV.", "I followed every instruction given from tech support, even when they contradicted each other and issues were not resolved. I am ultimately not sure if the TV was defective or if there was a mystery issue that was left unresolved, but it was not worth figuring out. Watching TV should not be this hard.", "Update 1/318: I wanted to add that I purchased Best Buy's brand Roku TV (Insignia Roku TV, basically the same thing as this one), and have had no issues with it AT ALL. So I do think the TV was the issue with the TCL. Highly recommend the Insignia - was a little cheaper and I've had this brand before with no complaints. I don't know why I didn't think if it when I first bought a TV!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Josh Steel"], "title": ["2016 model no good, upgrade to 2017"], "rating": ["4.0 out of 5 stars"], "date": ["on July 7, 2017"], "helpful_to": ["22 people found this helpful"], "content": ["Only reason for the four stars is because my first TCL 40\" 2016 television I bought caught fire last week for no reason, but I bought another one just like it. I love this brand of tvs so much because the price which you can't beat, and it's amazing picture quality. PS4 and Xbox one play flawlessly on the tv, with 3 HDMI ports I had enough ports for all electronics I wanted to hook up to. The 2016 model had everything crunched up in the back in one spot making access to wires or hangin a little difficult. The new tv which I purchased came in 2 days right on the dot, it is the 2017 model they moved all the HDMI ports to the left of the tv and put the ac input(power) cable on the right side to reduce clutter which I'm very fond of. Amazon if you see this I hope you are. Because I'm one satisfied Customer."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["GTX USER"], "title": ["Very happy with this purchase!"], "rating": ["5.0 out of 5 stars"], "date": ["on June 29, 2017"], "helpful_to": ["28 people found this helpful"], "content": ["This was the first new TV I ever bought. Up until now, it has been hand-me-downs and used TVs for cheap. I was extremely dismayed when the first unit I received was broken. However the return and replacement process was easy, free and only took 2 days before the replacement arrived. It was shipped in the original box which is very well packaged, so I think the first TV was just a fluke. It is a brightly colored TV box though, so the delivery person will probably not leave it at your door. I had to be present for UPS to drop off. But they didn't make me sign anything, so it might be hit or miss in your area. Keep that in mind when ordering.", "Actual product review. Wow. I. Am. Impressed. I've only had Netflix up until now, so this was a major upgrade for me. I am now jacked in to Roku and have added many channels to my TV to start my transition away from cable TV. I have not tested the OTA tuner yet, but will get to it eventually. If it has problems I will update this review. If it works I probably won't bother. There are 3 HDMI inputs (one is ARC enabled). It has a SPDIF output which I connected to my stereo. It also has an old school composite RCA input which I connected to my SNES. I'm really happy that they kept 1 old input like that.", "Now for the only downside. I am very tech savvy, just not very interested in most new tech. I design and program computers for a living. I understand the guts of hardware and software. I had no trouble at all with the setup of this TV and I was impressed by the level of integration with various web services. However, I think of my parents with a TV like this. If they could not get me to come set it up and train them how to use it multiple times, it would be returned. For an \"average\" person who is minimally savvy with their IPhone, this TV would be a challenge to set up. Maybe this is just the state of modern consumer tech, because it seems like TCL and Roku put a lot of effort into making the options well presented and organized. But there is a LOT in there. Don't buy this TV for your aging parents unless you want to be fiddling with it on every visit. But otherwise, its a solid purchase and you will not be disappointed.", "Oh and since it is a \"TV\" the picture quality is excellent. Not the best I have seen, but very very good. Especially at this price point.", "Update: I'm old enough to clearly remember the days when advertisers suddenly discovered that they could record their ads at higher volume so that the networks would play them at a higher volume and ANNOY THE HELL OUT OF ALL THEIR POTENTIAL CUSTOMERS! I'm new to smart TVs. Maybe it's this one free station. Maybe it's just a mistake with this one show. Heck it could even be a software bug. But it could also be that the laws written in response to the loud TV ads somehow don't apply to streaming content. Doesn't really matter though. I'm still happy with it and just like the good old days of analog TV the MUTE button works great when the ads come on."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["Keith B."], "title": ["So Far So Good 👍"], "rating": ["4.0 out of 5 stars"], "date": ["on August 7, 2018"], "helpful_to": ["7 people found this helpful"], "content": ["Well, it has been running six plus hours a day 4 - 5 nights a week for a while now and although I know other buyers have had issues this TV has been great. Out of the box it was four screws to put on the two reasonably sturdy feet. Connectors for power and HDMI were easily accessible. Setup was confusing at first. This is supposed to primarily be a Roku/streaming TV although it can work just fine with you cable or satellite provider's set top box. Included instructions didn't have a bypass the online setup section but TCL support quickly walked me through getting the TV connected to the cable box. Image quality is stunning. I was honestly amazed at how bright, vibrant and saturated the picture is. Sound quality is good, nothing spectacular but it does go loud which was a necessity as my mother, the primary user, is going deaf and at full volume couldn't hear her previous TV. She hears this set perfectly and there's plenty of volume left if her hearing issues worsen. I would recommend this set to anyone looking for an affordable TV."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["Annette D."], "title": ["Great value! - updated review (2)"], "rating": ["5.0 out of 5 stars"], "date": ["on October 27, 2017"], "helpful_to": ["4 people found this helpful"], "content": ["(Updated review) This TV is very nice! Its a good size for the dresser in the bedroom. I purchased it in the spring of 2017 for my vacation rental home and have had no customer complaints! Customers signed up for a roku account and got right onto their netflix accounts.", "I just purchased a second 32 inch TV for my home to replace an older outdated tube tv. Looking forward to getting it.... update!  Just got my second tv set up and enjoying my shows! Great picture too."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Rodney Moody"], "title": ["it was easy to setup and connect to my network"], "rating": ["4.0 out of 5 stars"], "date": ["on April 22, 2017"], "helpful_to": ["38 people found this helpful"], "content": ["Item arrived as promised, it was easy to setup and connect to my network. Prompted me for my Roku account and then began downloading the Roku apps."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["i know what i hear"], "title": ["Garbage"], "rating": ["2.0 out of 5 stars"], "date": ["on May 10, 2017"], "helpful_to": ["187 people found this helpful"], "content": ["I have the strongest internet connection available through my service provider. However, this tv, even thougb it states i have a good connection in the settings, continuously comes back with internet connection error. This happens randomly. I will watch a movie and suddenly will lose connection. It has nothing to do with my internet connection. I have a second TV. An ancient Sony Trinitron with a very old Roku hooked up to it. It never drops connection. Is in same room. Get a good look at the picture i provided. You will see a lot of that. I gave it two stars instead of one because the picture is quite nice...when it works."], "verification": [], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Joshua Comer"], "title": ["Great T.V..!!!! Cheaper than Dept.. stores. Well worth the wait.!!!!"], "rating": ["5.0 out of 5 stars"], "date": ["on May 15, 2017"], "helpful_to": ["24 people found this helpful"], "content": ["I love my new T.V. Super easy set-up. Easy remote. Easy interface. Cheaper than same T.V. at Department stores. It's super lite. I have it on a 360° wall mount. It's awesome couldn't be happeir."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Keith Krug"], "title": ["Would not purchase again."], "rating": ["1.0 out of 5 stars"], "date": ["on August 30, 2017"], "helpful_to": ["99 people found this helpful"], "content": ["Unit ordered/delivered late July 2017 installed mid August in new home. Almost immediately had issues with turning it on & off. Press remote power button  and it goes into endless loop of roku screen to blank and back to start screen. To get it to power on we have to unplug the unit and re plug. This is problematic as the unit is wall mounted with cabling behind the wall. We have to reach behind the dresser and pull up power strip to unplug. I've reset to factory spec, the unit is networked so I can assume it has the latest software. Totally disappointed in this tv. Thankfully it ,wasn't a ton of money, but a few hundred bucks wasted still pisses me off. I'll stick to LG or Samsung for its replacement. By the time I decided the tv was a lemon (3 days after install) the return window had passed by a few days and I had tossed the box anyway so all I can do is let everyone know how this tv worked out for us.", "UPDATE 09/01/2017 - TCL did contact me to ask for TV's ID so they could send a patch. Previous attempt to update software was hindered by TV thinking it had the latest update. It didn't. The patch was downloaded and appears to be working. At present the TV is turning off an on as it's supposed to. I didn't play around with it too much but it does seem to be responding faster as well.", "I'll update if it screws up again..."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Jason and Clara"], "title": ["This TV had a good picture. The only thing that got me was ..."], "rating": ["2.0 out of 5 stars"], "date": ["on August 8, 2017"], "helpful_to": ["6 people found this helpful"], "content": ["This TV had a good picture. The only thing that got me was the stand legs on the bottom. You have to thread the screws yourself, I had to put so much pressure that the screw literally broke while trying to thread them myself like the instructions said. It just did not go deep enough, or it tapered towards the end. To top it off they gave flat head screws instead of one with a point that they expect you to be able to thread the holes where they go. I unfortunately had to return this T.V."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Mrs. ABC"], "title": ["Wireless Wall mountable TV"], "rating": ["5.0 out of 5 stars"], "date": ["on November 26, 2017"], "helpful_to": ["7 people found this helpful"], "content": ["Bought at a good price during amazon prime only sale earlier in the year.  Quick easy set up with wall mount bought on amazon as well. Quick Easy wireless setup with access to applications such as Netflix, YouTube, HBO. Use on the wall for a room that’s 8 by 10 feet"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Cristy G"], "title": ["Great TV/picture for the price!"], "rating": ["5.0 out of 5 stars"], "date": ["on July 17, 2017"], "helpful_to": ["13 people found this helpful"], "content": ["So far we are super happy with this TV... especially for the price. Although, we have Roku plug-ins on all our other TV's, this is our first official Smart TV and we have found it very easy to set up and navigate. The remote is small and easy to use (similar to other Roku remotes) .. only wish we could swap out the CBSnews and Sling quick buttons for Hulu and Google... otherwise happy with the remote.", " Do to several other reviewer's posted issues with TLC's pixel flaws, we will definitely be keeping an eye out for that... .and will update review if we face any problems."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Customer"], "title": ["Great buy!!!"], "rating": ["5.0 out of 5 stars"], "date": ["on June 18, 2017"], "helpful_to": ["48 people found this helpful"], "content": ["Super easy to set-up, easy access to netflix and sling from your remote control.", "40 inch is a 40 inch screen indeed (don't know why another review complained about it).", "Loving it so far!!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Bestamazon Customer"], "title": ["Breaks !"], "rating": ["1.0 out of 5 stars"], "date": ["on July 12, 2018"], "helpful_to": ["13 people found this helpful"], "content": ["This is what happens to it i bought In April and this happened today"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["PS"], "title": ["Thet're junk, no customer service!!"], "rating": ["1.0 out of 5 stars"], "date": ["on December 17, 2017"], "helpful_to": ["9 people found this helpful"], "content": ["This is the second tv of this kind that I have received, because I had to return the first one, I could not get it to work, no customer service, they do not respond to calls or respond to emails even though they day they will, I will send this one back as soon as I get out of the the hospital & am able to purchase a new tv locally.........their service is terrible and the set up & \"ease\" of operation of the tv is not there...........really, I have 2 other smart tv's & no problems...............NO ROKU for me and I would never recommend one...........what a waste of time & $$"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Amazon shopper"], "title": ["Got this to use Netflix.. Netflix crashes repeatedly."], "rating": ["2.0 out of 5 stars"], "date": ["on September 29, 2017"], "helpful_to": ["18 people found this helpful"], "content": ["I'm incredibly frustrated with this product. I don't have cable so I got this to use streaming channels like Netflix, but the Netflix app on the Roku is so ridiculously glitchy it's not even worth having the TV anymore. Every 5-10 minutes, the app crashes and reverts to the home screen. It is not a problem with Netflix as it's working fine on my phone and laptop. I did some research and found that many other people have been having the exact same issue. I never leave negative reviews but this is egregious. Fix your system with an update that addresses this problem and I will update my rating accordingly."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Big Dog"], "title": ["I have several smart LG TVs and a Vizio"], "rating": ["5.0 out of 5 stars"], "date": ["on April 16, 2017"], "helpful_to": ["354 people found this helpful"], "content": ["I have several smart LG TVs and a Vizio. They are all great. However this is the best TV I have ever owned. I purchased it for a room that did not have a tv and took a chance. Easy to set up, great picture and sound. For the price it cannot be beat."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Kevin Speicher"], "title": ["Disappointed"], "rating": ["2.0 out of 5 stars"], "date": ["on May 1, 2018"], "helpful_to": ["4 people found this helpful"], "content": ["Overall, I’m disappointed. The picture is only fair; it breaks up, isn’t always clear and is poor when there’s fast motion on screen. The audio is also poor and I have to turn the volume up almost to the max in order to hear it well. I’m very surprised the ratings on this were so high and it was because of those ratings, that I purchased this TV. I should have spent more to get a better set."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["enero30"], "title": ["Great screen, but Roku is really slow"], "rating": ["4.0 out of 5 stars"], "date": ["on July 31, 2017"], "helpful_to": ["2 people found this helpful"], "content": ["Let me first say that the screen is gorgeous! Seriously, it's mesmerizing. We've been living with a Sony 32\" with a massive bezel for far too many years. The Mrs. just isn't into big TVs and I'm pretty much the same, just more forgiving. To me, nothing over 40\" is necessary for our living room. To her, nothing over 32\". This TV fit the bill perfectly, at least in size. The tiny bezel was perfect! It's pretty much the exact same size as our old TV! So we both win! My only gripe is with Roku. It is SLOOOOOW! It takes forever to turn on, forever to switch apps and forever to connect, forever to do pretty much anything. There's also some major lag between pressing buttons and the TV reacting. And it only seems to get worse as time goes by. We have this connected to an HTPC, and Ruko has taken much of the load off the PC, but sometimes its sluggishness is just too much to deal with. Another annoyance is the remote, it's got a really weird line of sight. We sit about 7 feet away from the screen and you have to hold it up and aim it at a weird angle for the TV to respond (there's nothing in between us and the TV). It would be nice if I could get our Harmony remote to work with this TV, but there doesn't seem to be a way to do it. I've tried everything, but no go. It's not TCL's fault. It's Logitech. But still would be nice to go back to a more responsive remote for this TV."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Shirley L."], "title": ["do not buy this"], "rating": ["1.0 out of 5 stars"], "date": ["on December 13, 2017"], "helpful_to": ["4 people found this helpful"], "content": ["i had the 2015 version which is crisp and sharp, that is why i m getting this one, but this one really disappointing me.  only movie mode is acceptable but too warm,  other modes will lose picture color and quality (unwatchable).  color mode only warn is working,  cool and normal will expose picture causing white dots.  do not get this one,  go for the 2015 version if tcl is still keeping up with the quality."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["Spenser2"], "title": ["So Far So Good"], "rating": ["4.0 out of 5 stars"], "date": ["on October 9, 2017"], "helpful_to": ["One person found this helpful"], "content": ["First I should say that I am not tech savvy so my opinion will be based on someone who is not that good with technology.", "So far the TV seems good but I just got it so I will update the review in a few months if there are any issues. I have noticed it seems to freeze up now and then for a few seconds. I will see how that goes", "I will say, for me, the setup was not quite as easy as some people have said it was to them. I feel like the navigation buttons on the remote are not that easy to navigate the TV and your wireless password and other things. It is nothing horrible but I would not say it is a piece of cake. Also if something goes wrong such as when I was trying to hook up my wireless it simply says to call support and it really doesn't give you any on screen or online information. Luckily I was able to get it to hook to my wireless but if I hadn't it would not have been an easy process to get a hold of someone it seems.", "I will say my cable provider Spectrum said their remote does not work with this TV so I have to use two remotes. Theirs to change channels and the one that came with the TV to turn the TV on and off and vokume. I don't know how that will work long-term but as far as I can tell that is the only way to do it and that's also what the cable provider said", "I will say that one of the other reviews mentioned that you must set up an account with your credit card number and it doesn't give you the option to skip that. However on mine there was an option at the very bottom to skip that if you wanted to.", "My TV I had for years died out so I had to get a new one. So far it seems okay. I am a bit skeptical but hopefully it will work properly. I wonder if anyone else has had the problem with the screen freezing up a bit for a 30 seconds or so?"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["The Southern Review"], "title": ["A Good TV at a Great Price"], "rating": ["5.0 out of 5 stars"], "date": ["on August 22, 2018"], "helpful_to": ["One person found this helpful"], "content": ["It looks like some people are having a not great experience with TCL. A friend of mine who deals in electronics told me that this brand was gaining popularity in the states and because it was not so well known, the prices were very affordable. Since he recommended it, we bought it in the 32 inch size. We had very few problems with the TV and if there were any issues, I’m not so sure it wasn’t our router causing them. I love being able to have Amazon Prime Video,  YouTube, Netflix, PBS Kids and all sorts of other channels available without additional hardware.", "We liked the TV so much that we bought the same TV in a bigger size to replace it. Our old TV was still in such great shape that I sold it and made a bunch my money back. Obviously, this is not the Cadillac of smart TVs. Some people seem to be getting duds. But I haven’t had any notable problems with ours. One thing I really like is the small intuitive remote. I’m so done with crazy complicated remotes. This one gets you where you need to go fast."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Daniel.Y"], "title": ["Never buy this product."], "rating": ["5.0 out of 5 stars"], "date": ["on June 20, 2017"], "helpful_to": ["657 people found this helpful"], "content": ["I am changing my rate from 5 stars to 1 star. Its been just a month since I purchased this item. It is now keep rebooting so I had to plug the power off. When I switch it on, it infinitely reboots itself. Boots --> Freeze --> Reboot --> Freeze --> Reboot. Terrible."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["Defective"], "rating": ["1.0 out of 5 stars"], "date": ["on October 8, 2017"], "helpful_to": ["18 people found this helpful"], "content": ["Would have given a 5 star rating but the audio has sound drops lasting 1 to 2 seconds.  Tv may work good for a day or two and the drops start all over and become more frequent the longer the tv is on. I read online this is caused when the optical board is had. Not getting anywhere with technical support as they are located in a foreign country and hard to understand. They had me unplug the tv for a few minutes then plug it back and turn it back on. They would only stay on the line 5 minutes and I was to tell them when it he sound dropped . Nothing happened because unplugging the tv solved the problem temporarily for about 6 hours. Apparently Samsung also put a lot of defective boards in their tv's and as far as I know the only remedy is to replace the board. Good picture for the money but would not buy this brand again because they know the board are defective and they are dumping on the consumer anyway."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Maria Golder"], "title": ["Brand New Remote in the box DID NOT operate the TV!"], "rating": ["4.0 out of 5 stars"], "date": ["on August 2, 2017"], "helpful_to": ["3 people found this helpful"], "content": ["Long story short: If you have an issue with this TV call AMAZON's customer service. NOT TCL. TCL's customer service is garbage. If it had not been for Amazon's great customer service, I would have mailed the whole TV back!", "Let me start by saying: Yes, the TV works completely fine. HOWEVER, when I ordered this TV for my son's bedroom for our new home, the remote DID NOT operate the TV whatsoever. I tried everything: new batteries, holding the power button, etc. The remote was absolute trash. Fortunately, the TV worked when I would manually power the TV from the button on the bottom of the unit, but I could not proceed pass the language options screen without having the REMOTE! There are no short cuts (you absolutely need THAT remote to get started)! So, I called TCL's customer service. The customer service agent tried to run through all of these methods to see if the remote will \"start\" working. Nope! So, the woman said that they will ship me a new remote....Two...weeks...later. No remote from TCL. I called them back. The gentleman stated that I should receive a remote in 2-3 business days. 10 days later....I was ready to send the whole TV back (at this point, I had the TV for about four weeks and could not use it).  I ended up calling Amazon's customer service line, and Amazon purchased a remote from a third party and had it mailed to me. I actually timely received that remote. Thanks to Amazon. NOT TCL.  Still waiting on the one remote that was supposed to come in 2-3 business days from TCL. Terrible.", "UPDATE: TCL's Director of Advocacy reached out to me directly to apologize for the experience that I had with TCL's representatives. I greatly appreciate TCL reaching out to me to discuss and resolve this issue. I love to see a company that is committed to customer satisfaction. Thanks for the call. TCL is alright in my book."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["ClintA"], "title": ["Approaching a month of use and its doing everything i ..."], "rating": ["4.0 out of 5 stars"], "date": ["on July 5, 2017"], "helpful_to": ["22 people found this helpful"], "content": ["Approaching a month of use and its doing everything i expect it to do for a $350 49 inch tv.  Wish it had an actual Ethernet port instead of being forced to use wifi just to avoid any possible interference or router issues.  Otherwise no complaints.  Will update if anything changes."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["Jennifer S."], "title": ["So far, so good"], "rating": ["5.0 out of 5 stars"], "date": ["on April 30, 2017"], "helpful_to": ["46 people found this helpful"], "content": ["I was a bit hesitant as this is not a very well known brand. I am, thus far, glad I took the chance as this: arrived quick & undamaged, set up was easy, has great features, and good quality picture... the roku is a nice bonus!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Pinkpeaches12"], "title": ["No problems here"], "rating": ["5.0 out of 5 stars"], "date": ["on May 18, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["I had this tv for a few months now and I had no problems with it. Its easy to connect my gaming system and switch back to the regular home screen. This tv is easy to get around with the apps. Netflix youtube amazon prime hulu and much more can be downloaded on the tv, you wont even need cable. Roku has its own channel so you can watch many things on there. The tv generally has a lot to offer, I would recomend it."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Chester Allen"], "title": ["One Star"], "rating": ["1.0 out of 5 stars"], "date": ["on November 1, 2017"], "helpful_to": ["13 people found this helpful"], "content": ["Two months and it is toast.  Not able to detect Wifi"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Samantha Rummel"], "title": ["Excellent little TV!!"], "rating": ["5.0 out of 5 stars"], "date": ["on June 9, 2017"], "helpful_to": ["40 people found this helpful"], "content": ["This is actually a great little TV! I had a bit of an issue setting it up because my internet provider was the issue, but I contacted the customer service number on the box and they were FABULOUS... this TV will let you (very easily) set up your directv, cable boxes, DVD players, and has a button for Amazon, Netflix, sets up your Hulu... The volume is very sufficient... It's just a great TV for your bedroom, guest room, kid's room... And the price is terrific... I'll definitely purchase another one for my guest room."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Sharon Stillson"], "title": ["Wasted money"], "rating": ["1.0 out of 5 stars"], "date": ["on March 6, 2018"], "helpful_to": ["26 people found this helpful"], "content": ["I bought this to replace a Samsung Smart TV. I had the Samsung for several years it worked wonderfully and I planned on purchasing another. Then when I read some of the reviews for the TLC especially in light of the price, I decided to try it. From day one it was a disappointment. The ad says easy to use remote. That's a joke. What about this remote is easy? First it's so limited it doesn't even have a control for volume. I end up switching back and forth between several remotes. Yes the app is an interesting but only when it works.", "The remote problem is exacerbated because the volume is inconsistent. The sound on one channel is a whisper but the commercials ear busting and the streaming channel is a different thing altogether. I think there must be a control somewhere to fix this but I'll be darned if I can find it.", "As for the easy interface for streaming, I didn't find that that either. Clunky.  Does not play well with others.", "Now for the best part. It has taken to freezing and shutting off. The picture melts and then reappears. This usually happens during something I've been waiting weeks to see.", "I miss my Samsung. I miss the remote that I could use any for almost everything."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["M. Gibbs"], "title": ["TV and Computer Monitor - works well for both uses!"], "rating": ["4.0 out of 5 stars"], "date": ["on April 29, 2018"], "helpful_to": ["4 people found this helpful"], "content": ["My main purpose in buying this TV was to use as a large computer monitor when I'm working on these massive spreadsheets and powerpoint presentations that are my world.  The second use was as an actual TV.", "The picture is really good and considering I'm sitting much closer than you would normally sit to a TV, I'm impressed.  The sound isn't bad but I'm not one of those finicky people about that either.", "I'm only giving it 4 starts because I quite hate the remote.  The mute button is just under the volume buttons on the SIDE so I very frequently mute when I want to increase or decrease the sound (even when using as a monitor I stream my music through the TV).", "For the price...you probably aren't going to find anything cheaper that is really a decent TV."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["great connectivity, image quality"], "rating": ["5.0 out of 5 stars"], "date": ["on October 8, 2017"], "helpful_to": ["6 people found this helpful"], "content": ["Just make sure you know what you are buying this TV for. If streaming is your thing, look no further. This set is relatively basic but everything is there: great connectivity, image quality, decent sound, comfortable controls, lightweight. My only regrets? I should have spent a bit more to get 4k instead of 1080P and maybe bigger size. It is surprisingly lightweight, modern looking and relatively slim. I would have gone with more sophisticated (and expensive) Samsung for things like live TV and gaming but this one is king for your streaming needs."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["worked out well for me"], "rating": ["4.0 out of 5 stars"], "date": ["on September 18, 2017"], "helpful_to": ["4 people found this helpful"], "content": ["when my mom's complex upgraded there in house TV antenna system Suddenly she needed a digital TV. This  TCL 32S305 32-Inch unit  seemed to fit the bill nicely and the price was very right. The Rocu remote was pretty \"old lady friendly\" (not to many buttons) but I expect her to get lost in the endless menus, However finding the antenna is not hard and when u turn off  when set to TV/antenna it restarts on TV.", "This is more than a TV...  It offers lots of one button streaming channels (like Netflicks)  and has all the HDMI and composite video inputs younger folks need/want/demand.  Its USB port has a nice audio/video/picture readers built in (however it only looks for MP4 videos and its USB menus are a TAD clunky until u get the hang of how they work). It has no CAST,  everything, including its wireless LAN  is straight forward.", "Overall it is pretty easy to set up and operate (my 90 year old mom may disagree but most will never need the book to get it going.)  A PDF book is on line if u want a larger copy of its included booklet.", "If this thing lasts I would give it 5 stars....  May get one for myself as an extra TV or computer monitor  Its picture is pretty dam crisp/clear.,  Sound is way better than my overpriced annoying to operate VISIO", "**** I did get one for me.... an amazing computer monitor and way cheaper than any actual 32 inch computer monitor... With the extra inputs it doubles as a easy to see monitor for my security system. . ."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["G. Hill"], "title": ["Can't wait to replace this one"], "rating": ["3.0 out of 5 stars"], "date": ["on May 6, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["PRO: The picture is very good. The Black Friday price and the delivery were great. Roku is the number one streaming device for good reason. It has all the cool stuff I loved about my Roku stick. The purchase of a TV integrated with Roku seemed like a good idea at the time, however…", "CONS: 1. Slow starts: if you're used to instant-on TV's, this might bother you.", "2. Annoying Remote (it's not the one depicted on the box): If you buy this, use the remote control app. The Roku remote (exactly the same as the Roku stick) can be very annoying because of the protruding buttons on the bottom. Just picking up the remote can kick you out of your program and start up one of the channels that occupy those four buttons at the bottom (Netflix, Amazon, CBS News, Sling). Imagine how annoying that can be late at night when all you wanted to do was lower the volume.", "3. The remote has no numbers, so using it to view regular TV can be tricky. Don't put it in a guest room because guests would never figure it out. There is a learning curve.", "4. This TV replaced a Samsung I used in my home office/bdrm as both a TV and a second monitor for my laptop. This TV will not get the resolution right when I plug in my laptop. It looks so awful it unusable as a monitor.", "5. Documentation is scant.", "BOTTOM LINE: I'm replacing this at the next opportunity. Having a hard time trying to figure out whom I might give it to because of the issues with the remote. Till then, I'll try using a universal remote to see if it resolves any issue with the Roku remote."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Super D"], "title": ["So Easy to Use and Enjoy"], "rating": ["5.0 out of 5 stars"], "date": ["on July 16, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["Great TV, love the interface.  Love Roku.  Only complaint is cheap feeling remote.  Not up to usual Roku remote standards, not sure why they would do that.  I have tried almost every streaming device except for the overpriced cr@pple.  I got tired of dealing with the other streamer's semi-walled gardens and came back to Roku where I can have all the major services.  One thing that impresses me about Roku is that my 7 year old streamer still works (albeit slowly).  This bodes well for having something that will still work (not out date) for years.  Having it built into the TV with a simple remote is just great especially for a bedroom.  Got my eye on a 4K one if my living room TV ever breaks.  Update:  still loving the TV.  I have bought the latest and greatest Roku box for my living room TV and it is plugged straight into my router.  The surprising thing is, this Roku TV, running on WiFi, quite a distance from the router, is faster and more responsive then the most expensive stand alone Roku!  Figure that one out.  I can't wait to replace my living room TV with a Roku one."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["J. Bak"], "title": ["Great little TV with built in Roku"], "rating": ["5.0 out of 5 stars"], "date": ["on August 18, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["I waited to write this since a lot of people have complained that the TV dies after less than a month.  I ordered it a month ago and today is the deadline for returning.  Hopefully it won't die tomorrow.  So far I have been very impressed with it.  It is SUPER light.  Shockingly so, but the picture quality is great, and I absolutely love that Roku is built in.  I already had an account that I got the first time I bought an external Roku, so it was easy to register this one.  I've not had even one problem with connecting to any of my online steaming, something I've not been able to say about my previous TV/Roku combination.  I couldn't even watch Netflix or Vudu at night, since it would go into an infinite buffering situation.  Hasn't happened even once yet, in the almost month I've had it.  My son loves to watch his Youtube videos on it.  It's smaller than my previous TV, but is a nice size once I got used to it.  It's very user friendly.", "I'll update if it dies tomorrow. :)"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Rescue Dog Fan"], "title": ["Constant Connectivity Issues"], "rating": ["1.0 out of 5 stars"], "date": ["on June 23, 2017"], "helpful_to": ["24 people found this helpful"], "content": ["We bought a Vizio Smart TV last year and love it - no issues whatsoever. We bought this tv based on the good reviews and we have had non-stop connectivity issues. We connect to the internet with no problem but after only one month of use - the tv is struggling to connect to our basic channels - Hulu - Amazon - Netflix.  We have been in touch with customer service for both the Tv and the Roku service and have unplugged, rebooted, set the tv back to factory specs....and still just can't make it work consistently. Frustrating...and won't buy again or recommend this brand to anyone"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Sandra Gonzalez"], "title": ["4 months in and works great!"], "rating": ["5.0 out of 5 stars"], "date": ["on April 2, 2018"], "helpful_to": ["One person found this helpful"], "content": ["I bought the 40 inch version for $250.  It shipped pretty fast in comparison to other stuff I get from Amazon which usually takes about a week to get shipped to Puerto Rico. For me, this was a great deal since TVs this size tend to be like $20 higher and without the smart TV option here.", "I’ve had the TV almost 4 months now and it works great. The remote is really straightforward. Love the interface and apps. Very easy to use and setup.", "This is the first TV I’ve ever bought but I think I made a great choice. The picture quality is awesome especially with Blue-ray movies. The sound is perfect for me. It’s not the loudest but it’s loud enough to be heard through cement walls and closed doors and for me to have to turn the volume down to let others sleep late at night when I’m still up watching TV.", "I know lots of other people have complained about the product and so I kept the box just in case I needed to return it. But so far, it’s worked perfectly well for me and I don’t expect it to malfunction. If it does, I’ll update this review."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Jon_Danger"], "title": ["Great, though not perfect small TV."], "rating": ["4.0 out of 5 stars"], "date": ["on October 13, 2017"], "helpful_to": ["One person found this helpful"], "content": ["I love this little TV.  Perfect for the bedroom, or for any small room that needs a tv.  Built in apps work great, remote is intuitive, and everything worked right out of the box.  It loses one star because I HATE the trend of TVs having 2 feet, because it makes it harder to find a place to put the TV, you need a pretty wide base. I have a dresser in the room this TV is in, that is fairly normally sized, and this 32 inch TV fits on there fine, but a bit larger, and it wouldn't fit at all.  This is a small TV, but it could be hard to find a table or place to set it.  Additionally, the roku apps on this TV don't work 100% as well as on a roku box.  The menus are just a tad slow.  Browsing is fine, but there is a noticeable input lag that I don't have on my other Roku box.  I would bet the processor in this TV is on the slower side.  I can't complain too much, for 170$ this TV is a great deal.  Hard to find a TV/streaming device combo for under 200 bucks better than this one."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Kindle Customer"], "title": ["2nd TV I've bought in this model, won't connect to wifi"], "rating": ["1.0 out of 5 stars"], "date": ["on November 18, 2017"], "helpful_to": ["6 people found this helpful"], "content": ["I have owned previous models of the TCL Roku TV, which all worked great. However this particular model (2nd one I've purchased through Amazon) is absolutely horrible, it will NOT connect to my home wifi, no matter what I try! Something has changed between the 2017 model and the 2016 (which connects just fine as do all of my other smart tvs) and I'll be starting my return for this one today."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["David"], "title": ["So far so good"], "rating": ["5.0 out of 5 stars"], "date": ["on June 26, 2017"], "helpful_to": ["3 people found this helpful"], "content": ["I am so happy with this thing, I was afraid that wasn't going to be \"smart\" enough and was going to be slow.... I tell you., have a Samsung same size in another room and compared to this one Samsung is garbage... I love Samsung brand., my phone, all my appliances, my biggest TV on the house, everything is Samsung and I'm happy with everything except the small TV, small TV is the slowest thing ever, if like me, you need a small TV for your room or whatever, this TCL is your best bet believe me", "...streaming is fast enough not to irritate you image is clear with good colors and unlike other brands is ready to Roku.... :)"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["kim-berly"], "title": ["This is just a great value for what you're getting."], "rating": ["5.0 out of 5 stars"], "date": ["on December 10, 2017"], "helpful_to": ["One person found this helpful"], "content": ["Even though this TV has ROKU, I still purchased ROKU 4 media streaming box. I'm glad I did. More channels and the remote has a chime when it gets lost, an earphone jack and voice commands. Haven't tried the voice commands yet. Still learning about it all.", "We purchased a Samsung Smart TV a couple of years ago and I was disappointed with the interface. ROKU is so much better I just can't believe it. And if I hadn't gotten the ROKU 4 I would still be happier with  the version of ROKU the TV comes with than the Samsung Smart TV.", "The picture is beautiful and the ROKU 4 has Dolby sound. And I love the Aquatic screen saver.", "This is just a great value for what you're getting. I can't believe I got a 2017 model at this price. The 32 inch is perfect for my bedroom."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["B. Arnold"], "title": ["Great price and excellent functionality"], "rating": ["5.0 out of 5 stars"], "date": ["on November 13, 2017"], "helpful_to": ["2 people found this helpful"], "content": ["WOW! It was purchased as a TV and a computer monitor. Now I need a wireless keyboard because I'm so close to the screen. I can surf the net in 40 glorious inches. It's so easy to set up whatever need it to do. The system will take you through each set. I'm in my early sixties and a little senile, but I set it up without my son's help. It's bright and colorful. The sound is not bad. I  have not adjusted any settings yet. And I still have the option to use my expensive audio headset. This is only day one, but at this price, I'm over the moon about this TV. A 40\" computer monitor would cost much more and do a lot less."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Emi Ruff"], "title": ["The perfect TV for cord cutters."], "rating": ["5.0 out of 5 stars"], "date": ["on August 15, 2018"], "helpful_to": ["One person found this helpful"], "content": ["I may be a millennial, but I’m a grandma when it comes to TV. I just want to turn my TV on, press a couple of buttons, and go straight to whatever show I’m binging on Netflix. The fact that this TV has Netflix and Hulu buttons right on the remote sold me. The sound and video quality are great for watching movies and TV at home, but if you’re a real audiophile you’ll probably want an external audio unit. For the price, I can’t imagine a more perfect TV for my needs.", "Word of advice: measure your TV stand. The little feet on the bottom are pretty wide set and if you’re not careful you’ll end up like I do with your TV spread across two shelves with a book to make up the height difference ..."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Abdul A."], "title": ["Super light weight...easy to mount"], "rating": ["5.0 out of 5 stars"], "date": ["on April 30, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["Super light weight and good picture quality. I have a previous model which is a lot heavier, but this model weighs almost as a couple of laptops. The legs are a bit flimsy but I have it wall mounted, so doesn’t matter much. The power cord seemed a bit shorter than other TVs, but wasn’t a big issue."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Rodney P. Burdick"], "title": ["Great TV for the price."], "rating": ["4.0 out of 5 stars"], "date": ["on March 27, 2018"], "helpful_to": ["One person found this helpful"], "content": ["After reading all the reviews I purchased the TCL. I had limited options since I needed the 32 inch for my bathroom. The stand is horrible, but I guess all manufacturers are moving to the legs instead of the center platform style. It doesn't seem as sturdy with the legs. I am mounting it on a wall so it doesn't matter anyway.", "The picture is good and clear and I haven't noticed any lag. I wish it was 1080p but at 32 inches it doesn't matter.", "The sound is good especially since it is being used in a smaller room.", "The ROKU is great. I get a ton of free content. There are too many options to go through and you can spend days figuring out what you want. I only plan on having a few channels listed on mine, but I was definitely impressed by the amount of free quality stations.", "I have experienced some lag while navigating the menu. It is  slow and is a bit annoying. The TV doesn't have the processing power of an xbox or other device and it is to be expected. Completely useable still but you will notice the lag while clicking around on the screen.", "The only bad thing about the tv is the remote. It is a horrible design. The volume buttons are on the side of the remote and hard to find. The buttons are in bad positions and the quick menu buttons are a waste of space. One or two buttons that were programmable would be perfect, but they over loaded it. My guess is they have an agreement with those companies and get paid for it. You will hate this remote.", "Overall the TV was perfect for my needs as a bathroom tv for news in the morning or a nice movie while in the bath. I would not buy such a cheap tv for the main room or as a gamer tv. But for 150 bucks it was a great buy. :)"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Sierra wanderer"], "title": ["Use the asterick button for adjustments"], "rating": ["4.0 out of 5 stars"], "date": ["on July 6, 2018"], "helpful_to": ["One person found this helpful"], "content": ["My initial impressions are generally good. I didn't like the default color scheme, seemed a bit washed out. It took me awhile to figure out how to adjust color - the home button only gets you to the brightness adjustment. Use the asterick(*) button to get to the advanced picture adjustment options - it works when in regular viewing mode, you can't access the fine adjustments if you've already used the home button. I view from about 8 feet away, and the 720p works just fine for TV/movies. I'd go with a 1080p TV if I was using it as a monitor, or viewing from closer than 5 feet - otherwise you may not be happy with the crispness of the picture. Obviously most gaming would require a completely different unit. Sound is better than my last TV, not too bad - sound adjustment is on the side of the remote."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["John Marino"], "title": ["Don't but this TV....Remote Breaks and There are no buttons on the actual device that powers on the TV"], "rating": ["1.0 out of 5 stars"], "date": ["on January 1, 2018"], "helpful_to": ["5 people found this helpful"], "content": ["Update,After having this T.V. for about a month the remote died on me. I replaced the batteries but the remote was dead. After trying everything nothing worked. I checked the negative reviews and searched google and apparently there is a problem with the remote. The video fixes on youtube were of no help as the TCL remote seems to not have the required button to reconnect the tv. What a disaster. You get what you pay for I guess."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Vnyrdstar"], "title": ["Good tv for Kitchen (17\" h \\ 25\" w)"], "rating": ["4.0 out of 5 stars"], "date": ["on December 14, 2017"], "helpful_to": ["One person found this helpful"], "content": ["So far one minor problem SOUND will speed up like a cartoon voice, using the back button then pushing the enter button seems to resolve the issue for the time, but I am concerned it will continue or worsen. Otherwise picture and sound are decent (28\"-w-720p fits under my kitchen cabinet, height with stand is 17\"), will update if other problems occur. Very glad however I purchased this during Amdazon prime day on Jul-11th 2017. If I had paid full price I would have been extremely upset. So I will say a good purchase NOT a great one, also this was purchased and is being used in my kitchen. Again being used in the kitchen while cooking or doing dishes or other distractions. I would be very annoyed if we were sitting down and trying to relax while watching movies. For movies I personally would have purchased a tv with higher resolution not the 720p this one has. Set up was easy and connects well to the internet, barring any other problems I would recommend the purchase (but not highly) ... Good Luck"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["Jennifer Dodds"], "title": ["HORRIBLE!!!!"], "rating": ["1.0 out of 5 stars"], "date": ["on July 19, 2018"], "helpful_to": ["4 people found this helpful"], "content": ["We have a 2200 sq ft home, with 3 google routers and fiber optic internet. We bought this TV as a bargain on Amazon prime day. We hooked it up, started streaming...and then had the tv lag about every 2 minutes while attempting to stream shows. Customer service was horrible trying to fix it. Blamed our internet. I explained i just tested it through google and we had 250mbps of download speed. They had no other suggestions and said I’d need to contact amazon for a return. DO NOT BUT FROM THEM"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Robert D. Akins"], "title": ["Better than you'd think, but not for long"], "rating": ["5.0 out of 5 stars"], "date": ["on August 29, 2018"], "helpful_to": ["One person found this helpful"], "content": ["It's been 2 years since I bought my first Roku TV. The picture on my first one is starting to go. There is vertical line blurring on my 50inch version. This smaller one, which I use far less, is holding up okay but the sound has never been great. The sound is a bit \"tinny\" and it's very quiet. When the air conditioning is on, I have to crank the sound up as high as it will go (100) to hear what's being said.", "Now, all that doesn't seem so bad though, considering the price of this TV and what you get. I will NEVER buy another TV unless it's a smart TV. And really, at this price, it'll probably also be a Roku. The website, where you set up your channels, is easy to use and the remote is intuitive. Even though the picture is fading on my larger TV, I'll probably replace it with another one of the same type.", "By the way, I bought some random TV mount for this smaller Roku TV from Lowe's. It totally fit and was easy as pie to hang on the wall."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["David Bailey"], "title": ["Worth. and then some."], "rating": ["5.0 out of 5 stars"], "date": ["on August 9, 2018"], "helpful_to": ["One person found this helpful"], "content": ["There were a lot of comments about defective units so I knew that I might be taking a gamble. But after a month of use it works great and has been so easy to use. I feel like most smart TV's I've come across have such a clunky/slow interface. The roku interface has been a breeze to use and I haven't had any issues.", "I'm not the biggest fan of the streaming app buttons on the device. There have been a few times where I've accidentally brushed up against the controller and it changes to Sling TV or something I never use. However the apps on the tv keep track of where you were and it takes like a second to get back to what you were watching.", "As far as the picture goes I have no complaints. It looks great so far. Just praying that no bars end up on the TV like I've seen some of the other people claim. For 200 dollars (prime day deal) this is hands down 5 stars (so far)."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Christopher D spencer"], "title": ["Overall pretty good"], "rating": ["5.0 out of 5 stars"], "date": ["on February 20, 2018"], "helpful_to": ["One person found this helpful"], "content": ["Overall it's a great TV. Picture is nice and clear. I watch a lot of HD YouTube videos and they play flawlessly. The remote feels kind of cheap. The Roku app on my smartphone makes typing much easier when searching as well as having remote features. Streaming from my laptop or cellphone works most of the time but occasionally will not connect for unknown reasons. I have several subscriptions running on it including Netflix, Amazon Prime, HBO NOW (part of Amazon Prime buta stand alone app) and a few others. Easy to set up in most cases. Usually just a code you have to log in on a computer or smartphone and enter to link your accounts.", "Only thing I am not 100% thrilled isthe buttons and speakers are on the bottom of the TV. This means sound is directed straight down instead of forward. A simple deflector madea big improvement on the sound output.", "**Update 6 months later....", "Still going strong. System did an update and streaming to the tv now works every time. Surprisingly the \"cheap remote\" is still in perfect working order. We've only changed the batteries once."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["brian mcintosh"], "title": ["It's been a month and it is perfect so far!"], "rating": ["5.0 out of 5 stars"], "date": ["on June 5, 2018"], "helpful_to": ["2 people found this helpful"], "content": ["They are right-- this home screen and remote are the easiest we have ever had!", "And the TV picture and quality are great-- especially for this price. I held my breath worried about some of the poorer reviews, but everything has been perfect here so far.", "Setting it up was easy-- it practically did it itself with wifi, antenna, devices, Netflix, and Hulu, and even hooked into Alexa without an issue.", "Now we are happily watching a glorious picture with all the fixings.", "(If you don't see an update added in later, then it means everything is still perfect!)"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Marc R."], "title": ["True size 28\" not 32\" but i think its ok..."], "rating": ["4.0 out of 5 stars"], "date": ["on May 4, 2017"], "helpful_to": ["47 people found this helpful"], "content": ["Is a good smart tv with an excellent screen resolution to be only 720p, I can not complain the picture is very clear and good sound. But besides that is very small to be 32 \"because its actual size is 28\" too small, the remote control is also quite uncomfortable personally would prefer a conventional. I think very good for the children's room"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Norman Davis"], "title": ["I really like this television."], "rating": ["4.0 out of 5 stars"], "date": ["on July 28, 2018"], "helpful_to": [], "content": ["Unfortunately it has problems.  First, I've order this exact TV twice.  One 14 months ago and it arrived with a broken screen. Not a problem with TCL television that it was damaged. Amazon is excellent with issues like this and immediately resolved the issue by replacing the TV.. The replaced TV lasted maybe 366 days before it started acting up. That was a TCL problem.  After a failed Seagate back-up drive 18 months ago (never happened before in 30 years) I've always purchased the longest extended warranty available. The warranty I purchased was excellent as well (SmartGuard). They provided me with an exact same make and model TV, which ALSO arrived with a broken screen.  Again Amazon was again excellent with this issue and I had a new TV in two days.  I again purchased the longest warranty available.  With the actual TV and its performance, I do sincerely really like it.  I want to recommend you buy it but I wouldn't buy anything these days without the warranty.  In the last two years I've not purchased an electronic device that has not failed after the initial warranty expired. So, I'm not sure I would say this is a bad TV just a bad trend in electronics manufacture.  This TV originally replaced a Samsung TV that lasted barely a year.  I'm no longer hesitate to buy brands I've never heard of because they are less expensive.  They work as well or better than I expected and broke down at the same rate as \"name brand\" products.  Always buy the warranty, you'll thank me some day.  A note to TCL, with my experience with TCL, I could have given one or five stars legitimately."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Zola Jones"], "title": ["Easy to Set Up, Love the Roku App as a Remote Control"], "rating": ["4.0 out of 5 stars"], "date": ["on January 16, 2018"], "helpful_to": ["2 people found this helpful"], "content": ["We've had this TV for a couple of months now and it's been really great. It was easy to set up and the included feet keep it standing on a table nicely. Since it's a smart TV, we first had to connect to it our wifi - which was really straightforward. Once the TV was connected to the internet, we started connecting all the subscription services. We didn't have a Roku account but that was easy to set up. And then it was a matter of logging in to various accounts - Netflix, Amazon, HBO Go and so one. There's an option of downloading additional channels from the Roku store. I immediately downloaded all the major networks and then used my cable provider's log-in to watch shows on demand. Being able to use the Roku app as a remote control is also really convenient when I can't find the remote that came with the TV.", "My only complaint about this TV is that it doesn't always automatically connect to the wifi after it's turned on. Sometimes I have to go through the process of selecting my wifi network in settings and then logging in again. Fortunately, the TV does remember my wifi credentials so I don't have to type them every time. "], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Dixie Lee"], "title": ["So far so good. This thing has been streaming for 16 hours ..."], "rating": ["5.0 out of 5 stars"], "date": ["on August 1, 2018"], "helpful_to": [], "content": ["So far so good. This thing has been streaming for 16 hours a day for an invalid since we got it last week. Other than being a bit clumsy to search on, (compared to having a keyboard) it is absolutely wonderful, and ESPECIALLY considering the price. I was very concerned about the sound because the patient is quite deaf, and the tablet we had set up over his bed was just not able to get enough volume. Also, its computer would decide to pause itself once in a while, and he has no idea how to get it back on track, let alone the thing getting bogged down from his interfacing the touch screen. THe remote that comes with this smart TV is NICELY simple!  I was more concerned about this TV having a rumble like young people go for, as that would just make the words impossible to understand. Anyway, it is clear as a bell, and other than the fact that if you prefer head banger sound, you probably wouldn't get a thumpy bass out of it, (thank GOD) what more can you ask for?  I have it sitting on about 45% volume and can hear it clearly in other rooms. Oh, the oddest thing is that if you want to see closed captioning (a MUST for us) on Netflix, you have to DE-select captioning on \"älways\" and instead select captioning  \"on mute only\" and you'll get the captions. While it's NOT on mute. HAHAHA. Took me a while to figure that one out, and only after unplugging everything etc. I wouldn't have even TRIED it on that setting except that it HAD been working before, so I was going through every possibility in case its computer had gotten stuck. (You never know- he has a lot of fun with the remote) We also bought the extended warranty so feeling very contented."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Zoe"], "title": ["Junk- slow, drops internet constantly"], "rating": ["1.0 out of 5 stars"], "date": ["on November 7, 2017"], "helpful_to": ["10 people found this helpful"], "content": ["It's a piece of junk. We have high speed internet. The other tv has s roku player hooked up and works fine. No Ethernet connection on this tv to go around the horrible internal wifi that doesn't work half the time. Change channels?  Connection drops. Today the blasted thing won't even boot up on Direct tv now. 169. Totally pissed away. Hate it hate it hate it. But from other reviews on here know I won't get my money back."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Luke F"], "title": ["Truly deserves the best seller position it holds"], "rating": ["5.0 out of 5 stars"], "date": ["on June 29, 2018"], "helpful_to": ["One person found this helpful"], "content": ["Thought this was a cheap knock off brand, but then saw it holds 4 of the 5 best sellers on Amazon for TVs. Decided to take a chance for a cheap screen, and was super surprised at just how good it really is. The speakers are garbage but, then again, most TV speakers are pretty bad. Pick up a cheap sound bar and this TV blows the others away for price:performance. Screen looks as good as my LG TV, but is half the price", "Fun fact: TCL is a self sufficient brand. Almost all TV manufacturers buy LG and samsung panel and rebrand them in a custom case as their own. TCL makes  their own TV screens. That's impressive, considering the cost of R&D to develop one that is as good as this compared to buying bulk from a supplier"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["Andrew C."], "title": ["Good Roku box with a tuner."], "rating": ["5.0 out of 5 stars"], "date": ["on October 4, 2017"], "helpful_to": ["3 people found this helpful"], "content": ["If you buy a TV from mail order always get a warrantee. My mother could lift this TV with one hand so I'm sure overworked mail men may toss it around. If it breaks Amazon has always been nice about returns and repairs. Just know its cool, fun and cheap, but won't be in the family for generations.  Unfortunately, my Apple TV passed on and it cost the same without a screen. The way tech works if it lasts a couple of years I'm happy."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Rhys Thurin"], "title": ["A budget-friendly second TV."], "rating": ["5.0 out of 5 stars"], "date": ["on April 19, 2018"], "helpful_to": ["One person found this helpful"], "content": ["Excellent value for money. It's important to note at the outset that this is definitely a budget TV. Not intended for your main home theater set-up or watching 4K video. But it truly excels in the budget niche. Mine is installed in the bedroom, and is used to view cable TV, with inputs from Amazon Fire TV and as a clone of my desktop monitor. It handles these tasks flawlessly, and I have no problem at all reading e-mail or Word documents from a distance of about 6 feet. The remote is small, but functional; volume controls are on the side, which takes getting used to, and it lacks a number pad, so changing channels can be a bit cumbersome. The remote has single-button access to Netflix, hulu, Sling and Roku, which is quite convenient. This TV is made to be viewed straight on, color washes rapidly when viewing from an angle. For the price (I paid 159.99), I'm not aware of anything that could compete in size, features and ease of set-up, which took less than 15 minutes including scanning for channels. Home run, TCL!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Rich W"], "title": ["Good TV, Lacking in somethings ... but quite happy with my buy."], "rating": ["5.0 out of 5 stars"], "date": ["on June 29, 2017"], "helpful_to": ["117 people found this helpful"], "content": ["Well i must say that I'm quite happy with the TV. I've been thinking of cutting the cord. Even tho I have cable, I don't think that I will have it for much longer. I've been watching all the free shows that you can get with this setup. I bought this for Sling and Netflix, still haven't made a account for ether. But as for the TV the picture is really good. Not as good as my last TV But for the price very nice. Settings in the TV are lacking, from what I can see there is NO WAY to set the IP address to static. So I had to change another device that I have had on the same LAN IP for over 5 yr that was a bit of a bummer. Sound on  the TV also good however there are pointing straight down. I am trying to figure out how to add a wireless system to it. Because my wife is slowly going def in one ear. And it's harder for her to hear my TV then hers. Setup for the TV was way easy, It dose a step by step walk through and has small video to get to know your Roku. Knowing that I was going to get this TV I also bought a Roku Streaming Stick (3600R) for my wife's TV and earlier this week my Bro / roommate bought the same TV as I Streaming in 3 rooms is wonderful. The TV is lighter that I though it would be. but over all I'm quite happy with my TV. I do wish I knew what chip set the TV has in it. 2,3,4 probable not a 4 but it would be nice to know the specs would I buy this TV again? Yes, yes I would however I hope that when that time comes I will be able to  get a 40 something or bigger. If your thinking of cutting the cord and or just want a good yet cheap in price TV this is the one I'm quite happy with ..  I hope that this helps someone find what there looking for .... (( To whom that read this. May you have a wonderful day / night ))"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["scoobiedubes"], "title": ["Dead in 3 months"], "rating": ["1.0 out of 5 stars"], "date": ["on August 24, 2017"], "helpful_to": ["11 people found this helpful"], "content": ["I really wanted to like this tv and for a few months I did. It was nice having everything integrated. Unfortunately none of that matters if it dies in 3 months. Now it is just in an endless restart loop that it won't come out of. TCL support is someplace offshore and not super helpful. Out of warranty so I am out of a tv. Quite a waste."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Grey Tiger"], "title": ["Still works great, no issues"], "rating": ["5.0 out of 5 stars"], "date": ["on May 13, 2018"], "helpful_to": [], "content": ["Purchased Nov 2017 as a cheap buy. Still works great, no issues. Image quality is average. You'll see banding and some pixilation depending on what your watching but it's", "Having said that I can't ask for much more from a $130 TV. I subscribe to a mix of to SlingTV, Amazon Prime and Netflix and also some of the apps available. This keeps my bill to under $40 (not including internet bill) and I switch up my services every few months. You don't get much live broadcast stations but a Digital Tuner should give you the basics. No online Browsing (so no free online movies). But on the free side you get: CBS (live news), Fox Now (movies, tv shows), FX now (movies), weather channel and some other random channel apps on the tv. Which is enough for random movies and TV shows.", "Best suited for people who watch a mimimim to average amount of TV as entertainment, or current Netflix/Prime subscribers. Also great for people who BINGE WATCH shows like Game of Thrones since you can always subscribe to the apps (HBO now/$15/mo), binge watch, then cut the cord.", "If you're someone who has specific shows, watches a lot MOVIES and LIVE TV, or wants a web browsing TV this might not be the best option. But it will give you some basic viewing options with a choices to expand.", "Very pleased. If the TV lasts 5 years I'll be happy. Even more pleased I can say bye-bye to Cox Communications who have done nothing but increase cable prices every year ($280, Tele, cable, internet with expanded basic cable). Bye Felicia!!"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Sophie Sadie"], "title": ["Smart, Excellent and Quality"], "rating": ["5.0 out of 5 stars"], "date": ["on April 23, 2018"], "helpful_to": ["3 people found this helpful"], "content": ["I like this TV so much. I was so impressed I bought one more for the Master bedroom.  I was worried that a thin TV would affect the sound (I had bought a 25 inch a few years back and the sound was horrible) The TCL has excellent sound, clarity of the picture and options.  I'm so impressed with the price and quality."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["54Yoshis"], "title": ["3/10 Would not recommend. Buy a Roku and TV separate and avoid the lag."], "rating": ["2.0 out of 5 stars"], "date": ["on July 5, 2017"], "helpful_to": ["5 people found this helpful"], "content": ["The picture is ok, the tv is very light but that's where the good stops. The Roku interface is so slow that it's unusable. I have a Roku stick and a Roku 3 that are both much faster than this TV interface. It is so bad that I had to just set it on HDMI input and plug in my laptop to watch netflix. Completely useless software."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["Good for the price"], "rating": ["4.0 out of 5 stars"], "date": ["on August 10, 2017"], "helpful_to": ["30 people found this helpful"], "content": ["I have had the 28-inch Roku smart tv for a little over three months. It was easy to set up in my guest bedroom, connect to my Comcast/Xfinity, and to find many interesting streaming channels. I was able to pair after considerable effort my Comcast:Xfinity remote to the Roku TV, but still have to click OK on the Roku remote to get to live TV. The biggest challenge was addressing the mediocre mono audio from the TV. After considerable research, I was able to address the issue by purchasing via Amazon the Easyday Toslink digital to analog converter, which enabled me to link the Roku TV audio to my five speaker surround sound system on my 12 year old Panasonic stereo system. Now it has excellent sound. After additional research and trial and error, I also was able to hook up an inexpensive media player, also purchased from Amazon, to play videos I had downloaded on my iMac and transferred to a hard disk drive. Roku technical assistance via email was very helpful in addressing these issues. For a total price of about $200 I was able to get not just the Roku TV, but also the Easyday toslink adaptor, and media player, which together provide a very good system - which makes it a good investment."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 28 inches", "Configuration: TV Only"]},
{"author": ["chris"], "title": ["GREAT bargain!"], "rating": ["5.0 out of 5 stars"], "date": ["on June 4, 2018"], "helpful_to": ["2 people found this helpful"], "content": ["We bought this TV because it is amazingly inexpensive for a bedroom TV.  I didn't have very high expectations but I am very pleased with the value I received in this purchase.", "Picture is decent with vibrant colors.  Setup was much easier than my much more expensive TV.", "The remote is very basic but much to my surprise this is actually a good feature.  The operation is very intuitive and smartly designed.", "If you want to set up a high end home theater, spend more money.  But if you want a TV to watch at a bargain basement price I would highly recommend considering this model."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Melanie"], "title": ["Good Deal"], "rating": ["4.0 out of 5 stars"], "date": ["on June 20, 2018"], "helpful_to": ["One person found this helpful"], "content": ["This TV has a good picture and considering the size and price.  I consider it a good option if you don't want to break the bank for a TV.  I chose to wall mount and it was fairly simple. It's easy to get set up.  If you've ever used Roku it exactly the same interface (as far as I can tell.)  I like having only one remote but was pleasantly surprised that I could use my cell phone as a remote as well.  Also thrilled that I could use our existing satellite service to add the premium channels I subscribe to already.  No antenna service where I am but Network TV isn't all that anyway.  I would have gone 5 stars if the resolution was just a bit better.  The volume is good for me sound clarity is good with no discernible distortion.  this TB is in my home office/studio so 32\" is the perfect size.  Not at all intrusive.  My only recommendation is that you may want a Wifi booster if your installation is remote from your Wifi server."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["WB IN CC. CA"], "title": ["Needed new TV for back deck purchased TLC 49” Roku Smart TV = $299"], "rating": ["5.0 out of 5 stars"], "date": ["on June 28, 2018"], "helpful_to": ["One person found this helpful"], "content": ["\"use this for a review if you like\"  Four in one product revue for DIY project.", "Needed new TV for back deck purchased TLC 49” Roku Smart TV = $299.99", "Wanted to mount it from above purchased Loctec CMI celling TV mount = $37.99", "Wanted ability to move for protection when not in use purchased 100PD sliding door Hardware = $32.06", "Needed to protect it form weather purchased outdoor TV cover 47” = $25.99", "Total project cost $$396.06. project time 2 to 3 hours", "# 1.  TLC TV, very satisfied, nice unit, good picture, easy to use, great price.", "#2.  Loctec celling mount. Very satisfied, 360° rotation and much more. I mounted it to wheels of pocket", "  Door hardware. This allowed it to rotate and roll  flat against the wall when not in use.", "#3.  Johnson Hardware  100PD sliding door Hardware. I mounted the track beneath upper deck with", "  Screws, attached the wheels to the TV mount. I left the end screw out far enough to keep the", "  Wheels from rolling out of track, remove screw to take off for winter.", "#4.  Mount Factory outdoor TV cover 47”. It is made to be removed each time you use it, I cut it on each", "  End and attached velcro so it can be opened the front rolled up and placed on top of TV when", "  viewing.", "SEE VIDEO", "ALL PRODUCTS FROM AMAZON"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 49 inches", "Configuration: TV Only"]},
{"author": ["Humberto"], "title": ["Reasonably price with Netflix issues"], "rating": ["3.0 out of 5 stars"], "date": ["on October 3, 2017"], "helpful_to": ["5 people found this helpful"], "content": ["I purchased 2 TCL TV's already, and I like them overall. If you watch Netflix alot, you can forget about this TV and the Roku integration. In both TV's, Netflix always kicks you out and then when you uninstall the app to re-install, it doesn't install. Some other apps also don't work at times. I was going to get a third TCL TV, but after these issues, I've reconsidered. For the price, its reasonable, but with the very faulty Netflix app, consider another TV."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 43 inches", "Configuration: TV Only"]},
{"author": ["debra"], "title": ["seems good at first /:"], "rating": ["1.0 out of 5 stars"], "date": ["on August 31, 2017"], "helpful_to": ["5 people found this helpful"], "content": ["it's suuuuper easy to use very nice interface you can purchase themes that are pretty cool and customized the remote is super simple very easy to use has a nwtflix button right on it super convenient being able to have all my consoles hooked up and ready at the same time and it's overall super simple and a great purchase very well worth the money", "edit: after 6 months it’s super laggy buttons don’t do anything until a long while after you push them it stops my applications and glitches out frequently and netflix stops working way too much i’ve had to factory reset it multiple times i’m sending it back"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["perfect for my"], "rating": ["1.0 out of 5 stars"], "date": ["on April 30, 2017"], "helpful_to": ["23 people found this helpful"], "content": ["After using this tv for about 2 months i started to notice some dead pixels...I didn't mind at first but then it gradually started speading across the top part of the screen...now there's this insane colored glitch on the top which ruins everything"], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]},
{"author": ["Customer"], "title": ["If you need good but cheap, this is it."], "rating": ["5.0 out of 5 stars"], "date": ["on August 26, 2017"], "helpful_to": ["3 people found this helpful"], "content": ["This tv is an amazing buy. It's a breeze to set up, the roku system is really user friendly. My tv took no time to get everything put together, plugged in  and updated, then set up preferences on roku's site. Super simple. And the picture is very nice. Now that being said, it's still only 720p so don't expect the hd you might be used to with a phone or another tv, BUT it's an amazing picture overall. I love it, you can't beat the price and I am extremely happy with my purchase. If you have an antenna to get air tv, it pulls in your signal and it displays it amazing clarity. I was having problems with my picture getting choppy, freezing, having problems and now that I have this tv, I have no problems. Every channel is crystal clear. If you are on a budget, this is a must buy.", "Edit: I have now had this tv for 4 months without any problems. It has great sound as well as picture for those who don't have external speaker systems. I use it with my firestick and it works great. It picks up WiFi well, connections are very fast. I haven't had a better tv for the money. I'm going to upgrade to their 55\" 4k model because it's affordable and extremely highly rated. Great tv's. Plus roku on the startup is nice, but u can program it to start up from an external source like cable, HDMI plug-ins, anything. If you are questioning it, just buy it. You won't regret it."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 32 inches", "Configuration: TV Only"]},
{"author": ["Amazon Customer"], "title": ["Very happy with performance of TCL"], "rating": ["5.0 out of 5 stars"], "date": ["on June 2, 2017"], "helpful_to": ["6 people found this helpful"], "content": ["Great TV for the money.  Set up was easy and quick, I'm excited to use Roku on a regular basis.  Picture quality is better than expected.  I have 5 HD TV's at home, all recent models and the new TCL performs better than all of the major brand TV's I currently have.  I mounted in a corner space to the wall and was able to do on my own as the weight of the TV is minimal.  The remote control is small and makes options easy to navigate.  I highly recommend this product and all TCL TV's if they perform the same way."], "verification": ["Verified Purchase"], "product_type": ["\n      Size: 40 inches", "Configuration: TV Only"]}
]