[
{"Review_author": ["megsmom", "sue", "united_red", "Saucy", "Hamlet La Mole", "Megan Riggen", "Bill Houston", "Alana Cushman", "Wanamama", "Grayham"], "Review_title": ["Great pic, easy set up, super fast shipping!!!", "Five Stars", "No cable box required for xfinity customers", "Nice picture.", "Imágenes reales y nitida", "great", "Hard to beat this deal! If you're looking for a bargain TV, this fits the bill.", "Easy to set up & very happy with it", "great little TV", "Set up"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars"], "Review_date": ["on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 3, 2018", "on September 2, 2018"], "Review_content": ["Moms gift was perfect", "nice", "Bought this tv as Roku & xfinity (Comcast) have a beta app so I did not require a cable box to watch everything, just hooked up wirelessly to my router in seconds", "Super impressed by the quality for the price", "Very nice picture, easy to set up, picks up a signal well.  Only issue is a tinny sound, but what do you expect from a cheap TV?", "Excelente tv", "Perfect tv, great price", "Picture, while only 720p, is plenty sharp for a bedroom TV from my viewing distance. Colors are true and bright, and no calibration needed. I thought I would need an external sound bar, but after wall mounting this, I found that not to be true. Sound quality is great for an inexpensive, smaller TV. Overall, I love it.", "For the price you can’t beat it! Easy to set up & very happy with it!!", "Easy to set up, clear picture, really lightweight ... no complaints.  And you do not have to use a credit card to set it up (you can do an internet search to find a way around this ... I did!).  I've only watched the free Roku channel on it (this is an extra TV that doesn't get a lot of use), but the Roku selection is good and the picture is good.  It looks like it will be easy to set up additional apps and components (DVD player).  I'll update my review if there are any issues, but I really don't anticipate any.", "Seems to working good so far."], "Review_helpfulness": []},
{"Review_author": ["AKIZON", "Chandler Peterson", "Jeffrey Baker", "Jennifer Walker", "Joe Soto", "Nadia Harun", "Robert D. Akins", "Jose G.", "mbg", "Elizabeth Rearick"], "Review_title": ["Roku TV", "Not bad, not great.", "Great deal", "After one month, this tv is not dependable", "Ripped me off", "We love this tv Great product don’t be afraid to purchase this TV", "Better than you'd think, but not for long", "Five Stars", "Worst remote ever", "Sleek design and Great Features!"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 30, 2018", "on August 30, 2018", "on August 30, 2018", "on August 29, 2018", "on August 29, 2018", "on August 29, 2018", "on August 29, 2018", "on August 29, 2018", "on August 29, 2018", "on August 29, 2018"], "Review_content": ["Watching it daily since I've ordered, my family is happy!", "It's a good tv, and we got a great deal.  But the pixels are already starting to act up and the tv will freeze and exit whatever you are doing from time to time.", "Great price", "I bought this tv on Amazon Prime Day. I was so excited to get such a good deal with Roku built in. But, the TV has been very disappointing. It rarely connects to Hulu or Netflix; I typically get some kind of error message or blank screen. It also frequently plays audio but shows only a black screen.", "Do not spend your money on this. I am very disappointed!!", "Definitely not a 32 inch tv, super small", "So love this TV I wasn’t  expecting it to be very sharp but I must say it is 4K so it is extremely sharp", "I wasent too familiar with this brand but it worked out well", "It's been 2 years since I bought my first Roku TV. The picture on my first one is starting to go. There is vertical line blurring on my 50inch version. This smaller one, which I use far less, is holding up okay but the sound has never been great. The sound is a bit \"tinny\" and it's very quiet. When the air conditioning is on, I have to crank the sound up as high as it will go (100) to hear what's being said.", "Now, all that doesn't seem so bad though, considering the price of this TV and what you get. I will NEVER buy another TV unless it's a smart TV. And really, at this price, it'll probably also be a Roku. The website, where you set up your channels, is easy to use and the remote is intuitive. Even though the picture is fading on my larger TV, I'll probably replace it with another one of the same type.", "By the way, I bought some random TV mount for this smaller Roku TV from Lowe's. It totally fit and was easy as pie to hang on the wall.", "Good tv", "Nothing special. not a main tv.", "No issues so far and loving all the features. We got this for our kids so that they could watch Netflix in their room without having to buy a game console."], "Review_helpfulness": ["2 people found this helpful", "One person found this helpful"]},
{"Review_author": ["John Conley", "Randy Dixon", "william thomas", "Joe", "Philip Anas Jr", "VMC", "Keith A. Parker", "Chris", "Amazon Customer", "deede56"], "Review_title": ["Better than expected, very nice picture, multiple inputs, unmatched price, Roku equipped. Durability ?", "Great value!", "Make sure to check as soon as you get it", "Five Stars", "Works great what a deal", "love!", "Poor quality, network card gives out", "Great TV for a bedroom!", "Four Stars", "seems fine for the price"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "4.0 out of 5 stars"], "Review_date": ["on August 25, 2018", "on August 25, 2018", "on August 25, 2018", "on August 25, 2018", "on August 25, 2018", "on August 25, 2018", "on August 24, 2018", "on August 24, 2018", "on August 24, 2018", "on August 24, 2018"], "Review_content": ["Set up, picture, sound, connections, and Roku are so far all better than expected, especially at this price on the 28 inch model I purchased. The TV arrived 2 days after ordering and was well and securely packaged. At first I was not so happy about having to screw in the two stands but it was actually pretty easy and it seems secure. Once turned on it asked for the internet password and it connected in a flash. The Roku likewise was a breeze, especially if you already have a Roku account. Be sure to be near a computer, tablet or smart phone in order to go to the Roku site to input the code the TV provides for completing the Roku set up.", " I like that there are multiple connecting ports, all of which are easily reached. Having 3 HDMI, including one with ARC was really a plus. I also connected an over the air antenna (we are cord cutters) and that, too, proved quite easy. Picture quality is not up to par with our much more expensive plasma set, but definitely quite good (4 out of 5 stars). The picture is bright out of the box with good contrast and fairly good viewing angles but controls for adjusting the picture are provided and very easy to use.", "The remote, like the TV, is very easy to use but the absence of a number pad is regrettable. If you have used a Roku or Firestick remote you will note similarities in the layout, with additional buttons for Netflix, Amazon, Sling and HULU. Batteries are also provided.", "Some people complained about the sound volume being inadequate but I had no problem hearing the TV in our bedroom, even with a loud fan running running near the TV. But if you prefer to add external speakers the needed input is there. It even provides an optical digital audio port.", "At this point the only issue I am somewhat apprehensive about is durability since this is the first TLC TV for me. With electronics I prefer brands such as Panasonic, LG, Sony, Samsung, etc. but this TV has mostly good reviews and with the incredible price I decided to take the plunge. If the TV seems to fail prematurely I will post a follow-up.", "In summary, the price is inbeatable, the picture better than expected, sound volume absolutely fine for a smaller room such as a bedroom (remember, I am rating a small 28 inch model), set up is a breeze, and the fact that it is Roku equipped and a Smart TV is great. It so far is exceeding expectations. It has a full array of inputs. The remote is adequate but lacks a number pad.", "The only concern will relate to durability over time.", "Easy to use, easy set up, great picture!", "The screen was cracked when I got it it's no more good and my return windows has closed I just wasted behind 125$", "It is exactly what I expected", "I was a little nervous for the deal of a price I paid. But I’m sure glad I took the risk, never heard of the brand or had a smart tv b4. But did a little research. It works wonderful. The 40in fits perfectly.", "Have this for a home gym set up and its amazing. Can link my headphones through the app on my phone which is way better than the initial set up I tried with a fancy samsung tv and separate bluetooth transmitter.", "Network card gave out after 18 months, conveniently just after the 1 year warranty. Stay away, low quality. Support in the Phillipines is of no help, they just say you have to buy a new one.", "I purchased the TCL 28\" TV after I purchased the 43\" TV for my parents for Christmas. Their bedroom TV finally died so they needed a replacement set. I decided on the TCL again as my parents were already familiar with the TCL platform. The TV is incredibly easy to use! I recommend picking up this TV for a spare bedroom.", "Muy buena imagen  ya es comprado 4 tv", "like everything so far! Gave a negative review on this product by mistake on amazon, (other purchase), don't see how to correct?"], "Review_helpfulness": ["One person found this helpful"]},
{"Review_author": ["Amazon Customer", "H.", "Danielle820", "LCfrosti", "Elizabeth bing", "London", "Diane Dudley", "randall rouse", "Princess Tiffany", "Marty"], "Review_title": ["A", "Worth of the money.", "Perfect for bedroom!", "Roku", "Best t.v. I've ever had!", "Not bad", "Completely stopped working", "Love This TV", "Perfect TV. Need bigger screws for mounting it", "great deal."], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 27, 2018", "on August 27, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018", "on August 26, 2018"], "Review_content": ["A", "Good picture quality, average sound. Smart apps is a huge advantage.", "Awesome picture quality and easy to add apps like Netflix,Plex and YouTube TV. The remote app which I added to my phone is neat! There’s an feature called private listening which is great where you can plug in your ear buds in and listen to the tv through the phone. Watched a movie while my boyfriend fell asleep for the night!", "Still figuring out picture quality, u get what u pay for. Research smart TV's Roku is cheap but in all fairness I live way out in desert so internet maybe to blame but honestly picture sucks so far. Get LG or Sony. I'm looking for hacks. And I'm not picky. Better than nothing but need better picture.", "I really love this tv. It's light and has a great picture. You can change the picture and sound quality and even dim the brightness on the screen. Perfect for my bedroom. It works pretty fast when connected to Wi-Fi. 10/10", "I'm very happy & satisfied with this TV", "Worked well for seven months then completely stopped working.  I’ve emailed TCL support, so we’ll see what they say.  Apparently  others are having the same issue (welcome screen reboot loop).", "The tv was super easy to set up. I did it by myself, not a tech savy girl, in about 20 min. And by setting it up I mean I added a DVD play, a Wii, logged into YouTube, Netflix, and added the legs of the TV stand and much more. The picture is perfect and the sound is really good too. I love that the remote is so simple and that everything is integrated into that one remote.", "For the price, these TVs are amazing. I have one in all the bedrooms. If you mount it, be prepared for it to need bigger screws than what come with most kits.", "I'm impressed with the quality received for the price paid. great deal."], "Review_helpfulness": ["One person found this helpful"]},
{"Review_author": ["Timothy", "Brenden Wahl", "Lisa N", "Amanda Gunter", "Angel Rijo", "James Walters", "susan piele", "Keri Sikora", "HarukaMS", "Amazon Customer"], "Review_title": ["Works as expected", "10/10 Highly recommend!", "Good tv, good value", "Five Stars", "Cracked screen why?", "Fast shipping", "Need no cable box needed!", "Wow, great price for what you get!!!!!!!!", "Affordable and Perfect", "I already have mine I got it for my mom I know she will appreciate it"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 29, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018"], "Review_content": ["Works as expected", "Freaking boss! We love it!", "Great tv - Roku work very well, good streaming, nice picture", "Such great clarity and looks,perfect above the fireplace.", "Cracked screen, what’s up with that?", "Love it have two.", "I got my little 28 in Roku television today I am 79 years old I took it out of the box I put it together I got all the channels lined up and I am happy happy happy really a nice little television and I'm sure I'm going to enjoy it without a cable box!", "TV is small, but worth the value. If you need simple yet excellent quality than this is it!! It is easy to program and figure out. My son can!!! It has easy touch bottons to Netflix, etc... it is easy to choose what stations you want to add plus has Youtube!! Worth the money", "I love this TV! I already had one and I ordered this one for my sister who’s TV recently broke. I love that’s it’s a reasonable price and still a smart TV. It’s nice to have Hulu and Nextflix already loaded and not have to use a game system to use them.", "Got it from my mom I know she'll just appreciate it"], "Review_helpfulness": []},
{"Review_author": ["Kelly B", "Ava Adediwura", "Stephen Flaherty", "theo2", "Amazon Customer", "Sandra Henderson", "Amazon Customer", "NAME_NOT_RETURNED", "gail hamilton johnson", "David Ortiz"], "Review_title": ["Good tv for a dorm", "Five Stars", "Perfect", "Annoyances of \"smart\" devices growing more ubiquitous with each passing day.", "Love it!", "This TV is great. It was exactly what i ordered and has ...", "My kids love coming in to watch it", "Love", "Great t.v", "Awesome tv & price"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 28, 2018", "on August 27, 2018", "on August 27, 2018", "on August 27, 2018", "on August 27, 2018"], "Review_content": ["We purchased this tv for our daughters dorm room.  It arrived quickly and without damage.  It is the perfect size so it can be seen from across the room and she will not need to pay extra for cable because the roku and Netflix are right on the screen.  Set-up was easy...so far,so good.  The picture is fine but the sound quality of the newer tvs will never match what it was on tvs back in the day.  I would recommend this tv.", "Love this tv. If you have prime so many more channels are added", "Great tv", "My experience w/three \"smart\" TV's (smart TV models/price points vary widely in extra features) from 2014 thru 2017 is that there is no way to be 100% not bothered by something intruding on screen that interferes with just watching movies from USB drive or off DVD player. It's always some annoyance coming on screen or confusing navigation of menu settings that drives user nuts. Needs to be easy to find menu setting which COMPLETELY disables anything on these smart sets from disturbing with watching of movies for those who desire it.", "Love my Tv, it is so light weight I can move it myself , the sound is good and i am very hard of hearing . I did have to go in the settings and switch to high volume setting. Glad I found that option", "This TV is great.  It was exactly what i ordered and has been a great purchase.", "Boy did I do research on this tv brand. I bought a 32 inch previously and didnt hesitate to buy this one. My kids love coming in to watch it. Netflix, prime video, google movies. All of them on top of cable. Kids dont know what to watch first. Love, love, love. Maybe 4k uhd next buy.", "Love", "Great t.v", "What a great tv. Gave it to a friend for his house warming party & he constantly says it’s a great tv. Great picture. Great internet connectivity. And the format to watch apps is simple & fast. What a great buy 🤙🏼🤙🏼."], "Review_helpfulness": ["One person found this helpful", "One person found this helpful"]},
{"Review_author": ["John K.", "Concerned Consumer", "Michael Horwath", "Wendy Michael", "Miguel Conchas", "G", "Lisa gremlich", "theresa guiberson", "Two Brown Birds", "SBra"], "Review_title": ["Great TV!", "Five Stars", "Really good for the price.", "Missing 1 important feature...", "Exceeded expectations. Great value.", "works great", "Works great", "Five Stars", "Works well!", "Not Recommended"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars"], "Review_date": ["on September 1, 2018", "on September 1, 2018", "on September 1, 2018", "on September 1, 2018", "on August 31, 2018", "on August 31, 2018", "on August 31, 2018", "on August 30, 2018", "on August 30, 2018", "on August 30, 2018"], "Review_content": ["Great picture!  Easy to use!  Friendly technology!", "Great buy. My first Roku Smart TV. I will purchase another.", "Great TV. Connects easily. Mounts perfect with TV mount.", "I am happy with this tv. The picture is outstanding, the audio is good, it was easy enough to attach to the wall bracket. Love that the Roku is part of the tv. BUT, I am using it in a bedroom and it doesn't have a sleep timer! If you want this tv for use in any other room, I can recommend it, however I am extremely disappointed that it is missing that important feature for bedroom use and can't recommend it for bedrooms.", "Easily my pride and joy from all my purchases on \"prime day\". I'm usually hesitant on purchasing electronics from small name brands but this TV has changed my attitude. Easy to use. Looks great. Roku works just fine. I ordered two 32 inch TCL tvs for my garage now.", "the Roku is way better than a fire stick", "It was an impulse buy and turned out to be a really good One! I was worried after I read some of the reviews, but I'm glad I didn't remember to read them until AFTER I purchased it.", "Great tv had for 9months no problems!", "We have had the tv for about a month now, no issues. It’s nice that it goes to sleep when it detects dormancy and the Roku app is a great way to control things when the tiny remote gets lost. The volume buttons being on the side of the remote is moderately annoying but we are getting used to it.", "Some folks might describe the picture quality as more “adequate” than “excellent” but I’m really not that particular. It looks great compared to our seven year old flat screen, so no complaints here. No software issues so far.", "No recommended at all, got it and install it and it has a yellow line in the middle of the screen didnt want to waste my time to return it and kept it but seriously next time i wont get any big electronics throught amazon"], "Review_helpfulness": ["One person found this helpful", "One person found this helpful"]},
{"Review_author": ["grandamage", "Felimar B.", "Kalen Hammack", "Tina", "Toby", "hagg62", "Kris Roszko", "Jose Coreas", "TexasLineman", "Martha A. Hurd Call"], "Review_title": ["Great for the price!", "good", "One Star", "Five Stars", "TV works GREAT. The \"off brand\" stigma worried me at first", "Five Stars", "easy to set up...", "Very good", "I cannot BELIEVE IT!  This is a 500.00 Experience for 123.00!  Delivered!", "Nice"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 24, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018", "on August 23, 2018"], "Review_content": ["Great TV for the money. Sound isnt as tingy as some cheaper TVs and thats a good thing! Roku works as expected and the picture quality is really good! Cant beat the price!", "good", "Terrible product. Don’t let the price entice you.", "Great color.", "TV works GREAT. The \"off brand\" stigma worried me at first, but it's cheaper than my roomates Sharp, and his isn't even a smart TV. So it's cheaper. Just as clear. And a smart TV. Definitely worth it", "love my big tv fit perfect in my bedroom cubby hole", "The picture isn't as 'perfect' as I'd like it.  Sometimes the colors are off.  I don't know if it's the tv or the internet connection - but overall, I love this tv.  This is my first ROKU and my next one will be one as well.  My only complaint is that I tend to do nothing on weekends because I'm watching my new TV!!", "It a really good tv", "I bought this for a guest bedroom.  Hooked it up to a wireless Hopper and literally in 10 minutes had this thing working on Youtube and one the Dish TV!  TV was extremely easy to pair with the Dish remote that came with the Hopper too.  Sound is fine in my application and the picture is exceptional.  I'm sure there are better televisions (I own three better) but I have ZERO TV's that have the value that this one does!  Exceptional experience - in my case anyway.  Vert intuitive.", "Was looking for a smart TV for the office , this is a great buy for the money, does it all and great picture and sound. time will tell."], "Review_helpfulness": ["One person found this helpful"]},
{"Review_author": ["brandon", "Ralph Barrera", "Amazon Customer", "tom blake", "Sylvia Pringle", "Darren", "7Lil", "Amazon Customer", "PaulAH", "Derek Romero"], "Review_title": ["Decent picture, Poor sound.", "Great price for the quality television.", "Cheap but cheap for a reason", "Remote stopped working within a month", "Great tv", "Tv works great for the price", "You get what you pay for", "Good quality TV", "easy set up and running", "Awesome quality for the price"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "3.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "2.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on September 2, 2018", "on September 2, 2018", "on September 2, 2018", "on September 2, 2018", "on September 2, 2018", "on September 2, 2018", "on September 2, 2018", "on September 1, 2018", "on September 1, 2018", "on September 1, 2018"], "Review_content": ["A solid basic smart TV if you don't have the money for something better. Granted I do not personally utilize the smart features as I use my Ps4 for all my needs. Picture is sufficient but I do utilize the \"vivid\" mode since the default is pretty bleak. The sound is easily the worst part of this TV and I would definitely recommend a sound bar, you can get used to how it sounds but the bass is especially lacking in movies watched on it. The stands are basic but they work and they aren't hard to install.", "I love this item. High quality resolution.", "These TCL TVs are cheap for a reason. I have two of them (one purchased target, one on amazon). Both occasionally have episodes of lagging, random reboots, long loading times, network connection problems, HDMI finding problems, almost everything under the sun. When everything works, it works well, except for the remote. The remote lags quite a bit 99.99% of the time. Best bet is to use the Roku remote app.", "Picture is great, sound is good. If your one to get frustrated easily with technology, you might want to save yourself some heart ache and look somewhere else.", "The TV is great. The remote control, however, stopped working after about 3 weeks. Fortunately, I could just download the Roku app onto my phone and use that.", "Great tv", "Works fine.", "I wasn't expecting much from a TV this cheap.  Initially, I was impressed with the quality; the picture is good and the sound is OK.  NOTE: I don't watch a whole lot of TV.  When I do, however, this thing is slow... there's a delay.  I especially notice when Netflix'ing or Amazon Video'ing- scrolling through menus and clicking through stuff takes especially long. I often get so annoyed with the delayed response that I click the Home button to get back to all the apps in hopes of resetting and getting it moving better. It doesn't work; the apps continue to run slow.  If I was an avid TVer I would have to buy a new TV because this one is pretty frustrating.", "Works great! Husband loves it!!", "first thing you notice is how lite this TV is, we purchased a bracket to hold it and the bracket was heavier than the TV, I hold the TV by the corners when I move it because it does not feel very strong on the edges", "That being said!", "This is a great TV it has a good picture and reasonable sound, it is easy to set up and to navigate.", "does not have bluetooth so no adding speakers but it does have audio out.", "Got this smart tv for my grandpa, awesome quality for it's price. It even comes with a free subscription to Roku TV(a streaming service similar to Netflix).", "You can literally just plug it in, connect Wi-Fi and start streaming for free."], "Review_helpfulness": ["One person found this helpful"]},
{"Review_author": ["Kristen Demastus", "Elena Fried", "Maria Daniels", "Philip Kearney", "mwt1016", "LayLay’sMama", "The Southern Review", "Amazon Customer", "jheller", "Mark in SD"], "Review_title": ["Love the TCL Roku tvs", "Smooth TV", "Dont buy", "Great little TV", "Great deal!", "Do not buy!", "A Good TV at a Great Price", "Good quality", "Top notch!", "seemless wireless with Plex"], "Review_rating": ["5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "4.0 out of 5 stars", "5.0 out of 5 stars", "1.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars", "5.0 out of 5 stars"], "Review_date": ["on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 22, 2018", "on August 21, 2018", "on August 21, 2018"], "Review_content": ["Can’t beat the picture, and roku software for the money", "Just received this TV a week ago. So far it's working pretty smoothly. I am very impressed with the Roku feature and the fact that one can easily switch between Roku and Cable so easily. Thank you, Amazon workers!", "Terrible TV. Set up was easy, but tv screen turned dark within 10 min , then completely black. Did online trouble shooting , didnt fix. Spoke to representative and got free shipping to get fixed and supposedly sent back within 7-10 days. Hassel is not worth it. Would not recommend at all. Only bad rating I have EVER given.", "Nice little TV. A few quirks with the user interface, but overall very happy with it.", "Great picture and sound. Nice slim bezel.", "Absolutely terrible customer care, my tv stopped working a week after the warranty ran out! I called they said they would make an exception and cover me because it was so close to the end date. I sent all the information I was supposed to and then they went back on their word and said there was nothing they were willing to do. I didn’t buy this tv for it to work for just one year! If I had known it was bad quality I would have chosen another manufacturer! NEVER buying TCL AGAIN!!!", "It looks like some people are having a not great experience with TCL. A friend of mine who deals in electronics told me that this brand was gaining popularity in the states and because it was not so well known, the prices were very affordable. Since he recommended it, we bought it in the 32 inch size. We had very few problems with the TV and if there were any issues, I’m not so sure it wasn’t our router causing them. I love being able to have Amazon Prime Video,  YouTube, Netflix, PBS Kids and all sorts of other channels available without additional hardware.", "We liked the TV so much that we bought the same TV in a bigger size to replace it. Our old TV was still in such great shape that I sold it and made a bunch my money back. Obviously, this is not the Cadillac of smart TVs. Some people seem to be getting duds. But I haven’t had any notable problems with ours. One thing I really like is the small intuitive remote. I’m so done with crazy complicated remotes. This one gets you where you need to go fast.", "I bought this for my grandma to replace her Samsung that went out on her. I am more than satisfied with this TV especially for the price!", "Love it so much I'm planning on buying a 65 inch for Christmas!", "Works at native HD resolutions with a wireless connection to my Plex system. Be sure to get the TCL app, not an imitation..."], "Review_helpfulness": ["One person found this helpful"]}
]